{"keras_version": "1.1.1", "config": [{"config": {"b_regularizer": null, "init": "glorot_uniform", "W_regularizer": null, "nb_col": 5, "trainable": true, "nb_row": 5, "subsample": [2, 2], "activation": "linear", "dim_ordering": "tf", "name": "convolution2d_1", "input_dtype": "float32", "border_mode": "valid", "bias": true, "activity_regularizer": null, "b_constraint": null, "batch_input_shape": [null, 160, 320, 3], "nb_filter": 24, "W_constraint": null}, "class_name": "Convolution2D"}, {"config": {"momentum": 0.99, "epsilon": 1e-05, "name": "batchnormalization_1", "axis": -1, "trainable": true, "beta_regularizer": null, "gamma_regularizer": null, "mode": 0}, "class_name": "BatchNormalization"}, {"config": {"trainable": true, "name": "activation_1", "activation": "relu"}, "class_name": "Activation"}, {"config": {"b_regularizer": null, "init": "glorot_uniform", "W_regularizer": null, "nb_col": 5, "trainable": true, "nb_row": 5, "subsample": [2, 2], "activation": "linear", "dim_ordering": "tf", "name": "convolution2d_2", "border_mode": "valid", "bias": true, "activity_regularizer": null, "b_constraint": null, "nb_filter": 36, "W_constraint": null}, "class_name": "Convolution2D"}, {"config": {"momentum": 0.99, "epsilon": 1e-05, "name": "batchnormalization_2", "axis": -1, "trainable": true, "beta_regularizer": null, "gamma_regularizer": null, "mode": 0}, "class_name": "BatchNormalization"}, {"config": {"trainable": true, "name": "activation_2", "activation": "relu"}, "class_name": "Activation"}, {"config": {"b_regularizer": null, "init": "glorot_uniform", "W_regularizer": null, "nb_col": 5, "trainable": true, "nb_row": 5, "subsample": [2, 2], "activation": "linear", "dim_ordering": "tf", "name": "convolution2d_3", "border_mode": "valid", "bias": true, "activity_regularizer": null, "b_constraint": null, "nb_filter": 48, "W_constraint": null}, "class_name": "Convolution2D"}, {"config": {"momentum": 0.99, "epsilon": 1e-05, "name": "batchnormalization_3", "axis": -1, "trainable": true, "beta_regularizer": null, "gamma_regularizer": null, "mode": 0}, "class_name": "BatchNormalization"}, {"config": {"trainable": true, "name": "activation_3", "activation": "relu"}, "class_name": "Activation"}, {"config": {"b_regularizer": null, "init": "glorot_uniform", "W_regularizer": null, "nb_col": 3, "trainable": true, "nb_row": 3, "subsample": [1, 1], "activation": "linear", "dim_ordering": "tf", "name": "convolution2d_4", "border_mode": "valid", "bias": true, "activity_regularizer": null, "b_constraint": null, "nb_filter": 64, "W_constraint": null}, "class_name": "Convolution2D"}, {"config": {"momentum": 0.99, "epsilon": 1e-05, "name": "batchnormalization_4", "axis": -1, "trainable": true, "beta_regularizer": null, "gamma_regularizer": null, "mode": 0}, "class_name": "BatchNormalization"}, {"config": {"trainable": true, "name": "activation_4", "activation": "relu"}, "class_name": "Activation"}, {"config": {"b_regularizer": null, "init": "glorot_uniform", "W_regularizer": null, "nb_col": 3, "trainable": true, "nb_row": 3, "subsample": [1, 1], "activation": "linear", "dim_ordering": "tf", "name": "convolution2d_5", "border_mode": "valid", "bias": true, "activity_regularizer": null, "b_constraint": null, "nb_filter": 64, "W_constraint": null}, "class_name": "Convolution2D"}, {"config": {"momentum": 0.99, "epsilon": 1e-05, "name": "batchnormalization_5", "axis": -1, "trainable": true, "beta_regularizer": null, "gamma_regularizer": null, "mode": 0}, "class_name": "BatchNormalization"}, {"config": {"trainable": true, "name": "activation_5", "activation": "relu"}, "class_name": "Activation"}, {"config": {"trainable": true, "name": "flatten_1"}, "class_name": "Flatten"}, {"config": {"input_dim": null, "b_regularizer": null, "init": "glorot_uniform", "W_regularizer": null, "trainable": true, "activation": "linear", "name": "dense_1", "activity_regularizer": null, "bias": true, "output_dim": 1164, "b_constraint": null, "W_constraint": null}, "class_name": "Dense"}, {"config": {"momentum": 0.99, "epsilon": 1e-05, "name": "batchnormalization_6", "axis": -1, "trainable": true, "beta_regularizer": null, "gamma_regularizer": null, "mode": 0}, "class_name": "BatchNormalization"}, {"config": {"trainable": true, "name": "activation_6", "activation": "relu"}, "class_name": "Activation"}, {"config": {"input_dim": null, "b_regularizer": null, "init": "glorot_uniform", "W_regularizer": null, "trainable": true, "activation": "linear", "name": "dense_2", "activity_regularizer": null, "bias": true, "output_dim": 100, "b_constraint": null, "W_constraint": null}, "class_name": "Dense"}, {"config": {"momentum": 0.99, "epsilon": 1e-05, "name": "batchnormalization_7", "axis": -1, "trainable": true, "beta_regularizer": null, "gamma_regularizer": null, "mode": 0}, "class_name": "BatchNormalization"}, {"config": {"trainable": true, "name": "activation_7", "activation": "relu"}, "class_name": "Activation"}, {"config": {"input_dim": null, "b_regularizer": null, "init": "glorot_uniform", "W_regularizer": null, "trainable": true, "activation": "linear", "name": "dense_3", "activity_regularizer": null, "bias": true, "output_dim": 50, "b_constraint": null, "W_constraint": null}, "class_name": "Dense"}, {"config": {"momentum": 0.99, "epsilon": 1e-05, "name": "batchnormalization_8", "axis": -1, "trainable": true, "beta_regularizer": null, "gamma_regularizer": null, "mode": 0}, "class_name": "BatchNormalization"}, {"config": {"trainable": true, "name": "activation_8", "activation": "relu"}, "class_name": "Activation"}, {"config": {"input_dim": null, "b_regularizer": null, "init": "glorot_uniform", "W_regularizer": null, "trainable": true, "activation": "linear", "name": "dense_4", "activity_regularizer": null, "bias": true, "output_dim": 10, "b_constraint": null, "W_constraint": null}, "class_name": "Dense"}, {"config": {"momentum": 0.99, "epsilon": 1e-05, "name": "batchnormalization_9", "axis": -1, "trainable": true, "beta_regularizer": null, "gamma_regularizer": null, "mode": 0}, "class_name": "BatchNormalization"}, {"config": {"trainable": true, "name": "activation_9", "activation": "tanh"}, "class_name": "Activation"}, {"config": {"input_dim": null, "b_regularizer": null, "init": "glorot_uniform", "W_regularizer": null, "trainable": true, "activation": "linear", "name": "dense_5", "activity_regularizer": null, "bias": true, "output_dim": 1, "b_constraint": null, "W_constraint": null}, "class_name": "Dense"}], "class_name": "Sequential"}