{"class_name": "Sequential", "config": [{"class_name": "Convolution2D", "config": {"W_constraint": null, "bias": true, "nb_filter": 24, "input_dtype": "float32", "b_constraint": null, "batch_input_shape": [null, 160, 320, 3], "nb_row": 5, "activity_regularizer": null, "activation": "linear", "dim_ordering": "tf", "name": "convolution2d_21", "subsample": [2, 2], "W_regularizer": null, "nb_col": 5, "trainable": true, "init": "glorot_uniform", "b_regularizer": null, "border_mode": "same"}}, {"class_name": "BatchNormalization", "config": {"momentum": 0.99, "name": "batchnormalization_32", "beta_regularizer": null, "epsilon": 1e-05, "trainable": true, "mode": 0, "axis": -1, "gamma_regularizer": null}}, {"class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "Conv1"}}, {"class_name": "Convolution2D", "config": {"W_constraint": null, "bias": true, "nb_filter": 36, "b_constraint": null, "nb_row": 5, "activity_regularizer": null, "activation": "linear", "dim_ordering": "tf", "name": "convolution2d_22", "subsample": [2, 2], "W_regularizer": null, "nb_col": 5, "trainable": true, "init": "glorot_uniform", "b_regularizer": null, "border_mode": "valid"}}, {"class_name": "BatchNormalization", "config": {"momentum": 0.99, "name": "batchnormalization_33", "beta_regularizer": null, "epsilon": 1e-05, "trainable": true, "mode": 0, "axis": -1, "gamma_regularizer": null}}, {"class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "Conv2"}}, {"class_name": "MaxPooling2D", "config": {"dim_ordering": "tf", "name": "maxpooling2d_7", "strides": [2, 2], "trainable": true, "pool_size": [2, 2], "border_mode": "valid"}}, {"class_name": "Convolution2D", "config": {"W_constraint": null, "bias": true, "nb_filter": 48, "b_constraint": null, "nb_row": 5, "activity_regularizer": null, "activation": "linear", "dim_ordering": "tf", "name": "convolution2d_23", "subsample": [1, 1], "W_regularizer": null, "nb_col": 5, "trainable": true, "init": "glorot_uniform", "b_regularizer": null, "border_mode": "valid"}}, {"class_name": "BatchNormalization", "config": {"momentum": 0.99, "name": "batchnormalization_34", "beta_regularizer": null, "epsilon": 1e-05, "trainable": true, "mode": 0, "axis": -1, "gamma_regularizer": null}}, {"class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "Conv3"}}, {"class_name": "MaxPooling2D", "config": {"dim_ordering": "tf", "name": "maxpooling2d_8", "strides": [2, 2], "trainable": true, "pool_size": [2, 2], "border_mode": "valid"}}, {"class_name": "Convolution2D", "config": {"W_constraint": null, "bias": true, "nb_filter": 64, "b_constraint": null, "nb_row": 3, "activity_regularizer": null, "activation": "linear", "dim_ordering": "tf", "name": "convolution2d_24", "subsample": [1, 1], "W_regularizer": null, "nb_col": 3, "trainable": true, "init": "glorot_uniform", "b_regularizer": null, "border_mode": "valid"}}, {"class_name": "BatchNormalization", "config": {"momentum": 0.99, "name": "batchnormalization_35", "beta_regularizer": null, "epsilon": 1e-05, "trainable": true, "mode": 0, "axis": -1, "gamma_regularizer": null}}, {"class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "Conv4"}}, {"class_name": "Convolution2D", "config": {"W_constraint": null, "bias": true, "nb_filter": 64, "b_constraint": null, "nb_row": 3, "activity_regularizer": null, "activation": "linear", "dim_ordering": "tf", "name": "convolution2d_25", "subsample": [1, 1], "W_regularizer": null, "nb_col": 3, "trainable": true, "init": "glorot_uniform", "b_regularizer": null, "border_mode": "valid"}}, {"class_name": "BatchNormalization", "config": {"momentum": 0.99, "name": "batchnormalization_36", "beta_regularizer": null, "epsilon": 1e-05, "trainable": true, "mode": 0, "axis": -1, "gamma_regularizer": null}}, {"class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "Conv5"}}, {"class_name": "MaxPooling2D", "config": {"dim_ordering": "tf", "name": "maxpooling2d_9", "strides": [2, 2], "trainable": true, "pool_size": [2, 2], "border_mode": "valid"}}, {"class_name": "Flatten", "config": {"trainable": true, "name": "flatten_5"}}, {"class_name": "Dense", "config": {"W_constraint": null, "bias": true, "input_dim": null, "b_constraint": null, "activity_regularizer": null, "activation": "linear", "name": "dense_18", "W_regularizer": null, "output_dim": 1164, "trainable": true, "init": "glorot_uniform", "b_regularizer": null}}, {"class_name": "BatchNormalization", "config": {"momentum": 0.99, "name": "batchnormalization_37", "beta_regularizer": null, "epsilon": 1e-05, "trainable": true, "mode": 0, "axis": -1, "gamma_regularizer": null}}, {"class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "FC1"}}, {"class_name": "Dense", "config": {"W_constraint": null, "bias": true, "input_dim": null, "b_constraint": null, "activity_regularizer": null, "activation": "linear", "name": "dense_19", "W_regularizer": null, "output_dim": 100, "trainable": true, "init": "glorot_uniform", "b_regularizer": null}}, {"class_name": "BatchNormalization", "config": {"momentum": 0.99, "name": "batchnormalization_38", "beta_regularizer": null, "epsilon": 1e-05, "trainable": true, "mode": 0, "axis": -1, "gamma_regularizer": null}}, {"class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "FC2"}}, {"class_name": "Dense", "config": {"W_constraint": null, "bias": true, "input_dim": null, "b_constraint": null, "activity_regularizer": null, "activation": "linear", "name": "dense_20", "W_regularizer": null, "output_dim": 50, "trainable": true, "init": "glorot_uniform", "b_regularizer": null}}, {"class_name": "BatchNormalization", "config": {"momentum": 0.99, "name": "batchnormalization_39", "beta_regularizer": null, "epsilon": 1e-05, "trainable": true, "mode": 0, "axis": -1, "gamma_regularizer": null}}, {"class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "FC3"}}, {"class_name": "Dense", "config": {"W_constraint": null, "bias": true, "input_dim": null, "b_constraint": null, "activity_regularizer": null, "activation": "linear", "name": "dense_21", "W_regularizer": null, "output_dim": 10, "trainable": true, "init": "glorot_uniform", "b_regularizer": null}}, {"class_name": "BatchNormalization", "config": {"momentum": 0.99, "name": "batchnormalization_40", "beta_regularizer": null, "epsilon": 1e-05, "trainable": true, "mode": 0, "axis": -1, "gamma_regularizer": null}}, {"class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "FC4"}}, {"class_name": "Dense", "config": {"W_constraint": null, "bias": true, "input_dim": null, "b_constraint": null, "activity_regularizer": null, "activation": "linear", "name": "output", "W_regularizer": null, "output_dim": 1, "trainable": true, "init": "glorot_uniform", "b_regularizer": null}}], "keras_version": "1.1.1"}