{"class_name": "Sequential", "config": [{"class_name": "Convolution2D", "config": {"W_constraint": null, "bias": true, "nb_filter": 24, "input_dtype": "float32", "b_constraint": null, "batch_input_shape": [null, 160, 320, 3], "nb_row": 5, "activity_regularizer": null, "activation": "linear", "dim_ordering": "tf", "name": "convolution2d_26", "subsample": [2, 2], "W_regularizer": null, "nb_col": 5, "trainable": true, "init": "glorot_uniform", "b_regularizer": null, "border_mode": "same"}}, {"class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "Conv1"}}, {"class_name": "Convolution2D", "config": {"W_constraint": null, "bias": true, "nb_filter": 36, "b_constraint": null, "nb_row": 5, "activity_regularizer": null, "activation": "linear", "dim_ordering": "tf", "name": "convolution2d_27", "subsample": [2, 2], "W_regularizer": null, "nb_col": 5, "trainable": true, "init": "glorot_uniform", "b_regularizer": null, "border_mode": "valid"}}, {"class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "Conv2"}}, {"class_name": "MaxPooling2D", "config": {"dim_ordering": "tf", "name": "maxpooling2d_10", "strides": [2, 2], "trainable": true, "pool_size": [2, 2], "border_mode": "valid"}}, {"class_name": "Dropout", "config": {"name": "dropout_5", "trainable": true, "p": 0.5}}, {"class_name": "Convolution2D", "config": {"W_constraint": null, "bias": true, "nb_filter": 48, "b_constraint": null, "nb_row": 5, "activity_regularizer": null, "activation": "linear", "dim_ordering": "tf", "name": "convolution2d_28", "subsample": [1, 1], "W_regularizer": null, "nb_col": 5, "trainable": true, "init": "glorot_uniform", "b_regularizer": null, "border_mode": "valid"}}, {"class_name": "BatchNormalization", "config": {"momentum": 0.99, "name": "batchnormalization_41", "beta_regularizer": null, "epsilon": 1e-05, "trainable": true, "mode": 0, "axis": -1, "gamma_regularizer": null}}, {"class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "Conv3"}}, {"class_name": "Convolution2D", "config": {"W_constraint": null, "bias": true, "nb_filter": 64, "b_constraint": null, "nb_row": 3, "activity_regularizer": null, "activation": "linear", "dim_ordering": "tf", "name": "convolution2d_29", "subsample": [1, 1], "W_regularizer": null, "nb_col": 3, "trainable": true, "init": "glorot_uniform", "b_regularizer": null, "border_mode": "valid"}}, {"class_name": "BatchNormalization", "config": {"momentum": 0.99, "name": "batchnormalization_42", "beta_regularizer": null, "epsilon": 1e-05, "trainable": true, "mode": 0, "axis": -1, "gamma_regularizer": null}}, {"class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "Conv4"}}, {"class_name": "MaxPooling2D", "config": {"dim_ordering": "tf", "name": "maxpooling2d_11", "strides": [2, 2], "trainable": true, "pool_size": [2, 2], "border_mode": "valid"}}, {"class_name": "Dropout", "config": {"name": "dropout_6", "trainable": true, "p": 0.5}}, {"class_name": "Flatten", "config": {"trainable": true, "name": "flatten_6"}}, {"class_name": "Dense", "config": {"W_constraint": null, "bias": true, "input_dim": null, "b_constraint": null, "activity_regularizer": null, "activation": "linear", "name": "dense_22", "W_regularizer": null, "output_dim": 1164, "trainable": true, "init": "glorot_uniform", "b_regularizer": null}}, {"class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "FC1"}}, {"class_name": "Dense", "config": {"W_constraint": null, "bias": true, "input_dim": null, "b_constraint": null, "activity_regularizer": null, "activation": "linear", "name": "dense_23", "W_regularizer": null, "output_dim": 100, "trainable": true, "init": "glorot_uniform", "b_regularizer": null}}, {"class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "FC2"}}, {"class_name": "Dense", "config": {"W_constraint": null, "bias": true, "input_dim": null, "b_constraint": null, "activity_regularizer": null, "activation": "linear", "name": "dense_24", "W_regularizer": null, "output_dim": 50, "trainable": true, "init": "glorot_uniform", "b_regularizer": null}}, {"class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "FC3"}}, {"class_name": "Dense", "config": {"W_constraint": null, "bias": true, "input_dim": null, "b_constraint": null, "activity_regularizer": null, "activation": "linear", "name": "dense_25", "W_regularizer": null, "output_dim": 10, "trainable": true, "init": "glorot_uniform", "b_regularizer": null}}, {"class_name": "BatchNormalization", "config": {"momentum": 0.99, "name": "batchnormalization_43", "beta_regularizer": null, "epsilon": 1e-05, "trainable": true, "mode": 0, "axis": -1, "gamma_regularizer": null}}, {"class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "FC4"}}, {"class_name": "Dense", "config": {"W_constraint": null, "bias": true, "input_dim": null, "b_constraint": null, "activity_regularizer": null, "activation": "relu", "name": "output", "W_regularizer": null, "output_dim": 1, "trainable": true, "init": "glorot_uniform", "b_regularizer": null}}], "keras_version": "1.1.1"}