{"class_name": "Model", "config": {"layers": [{"class_name": "InputLayer", "inbound_nodes": [], "name": "input_4", "config": {"sparse": false, "name": "input_4", "batch_input_shape": [null, 160, 320, 3], "input_dtype": "float32"}}, {"class_name": "Convolution2D", "inbound_nodes": [[["input_4", 0, 0]]], "name": "convolution2d_283", "config": {"trainable": false, "b_regularizer": null, "name": "convolution2d_283", "init": "glorot_uniform", "b_constraint": null, "subsample": [2, 2], "border_mode": "valid", "nb_filter": 32, "W_regularizer": null, "W_constraint": null, "activity_regularizer": null, "activation": "relu", "dim_ordering": "tf", "nb_row": 3, "bias": true, "nb_col": 3}}, {"class_name": "BatchNormalization", "inbound_nodes": [[["convolution2d_283", 0, 0]]], "name": "batchnormalization_285", "config": {"mode": 0, "gamma_regularizer": null, "momentum": 0.99, "name": "batchnormalization_285", "beta_regularizer": null, "trainable": false, "epsilon": 1e-05, "axis": 3}}, {"class_name": "Convolution2D", "inbound_nodes": [[["batchnormalization_285", 0, 0]]], "name": "convolution2d_284", "config": {"trainable": false, "b_regularizer": null, "name": "convolution2d_284", "init": "glorot_uniform", "b_constraint": null, "subsample": [1, 1], "border_mode": "valid", "nb_filter": 32, "W_regularizer": null, "W_constraint": null, "activity_regularizer": null, "activation": "relu", "dim_ordering": "tf", "nb_row": 3, "bias": true, "nb_col": 3}}, {"class_name": "BatchNormalization", "inbound_nodes": [[["convolution2d_284", 0, 0]]], "name": "batchnormalization_286", "config": {"mode": 0, "gamma_regularizer": null, "momentum": 0.99, "name": "batchnormalization_286", "beta_regularizer": null, "trainable": false, "epsilon": 1e-05, "axis": 3}}, {"class_name": "Convolution2D", "inbound_nodes": [[["batchnormalization_286", 0, 0]]], "name": "convolution2d_285", "config": {"trainable": false, "b_regularizer": null, "name": "convolution2d_285", "init": "glorot_uniform", "b_constraint": null, "subsample": [1, 1], "border_mode": "same", "nb_filter": 64, "W_regularizer": null, "W_constraint": null, "activity_regularizer": null, "activation": "relu", "dim_ordering": "tf", "nb_row": 3, "bias": true, "nb_col": 3}}, {"class_name": "BatchNormalization", "inbound_nodes": [[["convolution2d_285", 0, 0]]], "name": "batchnormalization_287", "config": {"mode": 0, "gamma_regularizer": null, "momentum": 0.99, "name": "batchnormalization_287", "beta_regularizer": null, "trainable": false, "epsilon": 1e-05, "axis": 3}}, {"class_name": "MaxPooling2D", "inbound_nodes": [[["batchnormalization_287", 0, 0]]], "name": "maxpooling2d_10", "config": {"pool_size": [3, 3], "trainable": false, "name": "maxpooling2d_10", "border_mode": "valid", "strides": [2, 2], "dim_ordering": "tf"}}, {"class_name": "Convolution2D", "inbound_nodes": [[["maxpooling2d_10", 0, 0]]], "name": "convolution2d_286", "config": {"trainable": false, "b_regularizer": null, "name": "convolution2d_286", "init": "glorot_uniform", "b_constraint": null, "subsample": [1, 1], "border_mode": "valid", "nb_filter": 80, "W_regularizer": null, "W_constraint": null, "activity_regularizer": null, "activation": "relu", "dim_ordering": "tf", "nb_row": 1, "bias": true, "nb_col": 1}}, {"class_name": "BatchNormalization", "inbound_nodes": [[["convolution2d_286", 0, 0]]], "name": "batchnormalization_288", "config": {"mode": 0, "gamma_regularizer": null, "momentum": 0.99, "name": "batchnormalization_288", "beta_regularizer": null, "trainable": false, "epsilon": 1e-05, "axis": 3}}, {"class_name": "Convolution2D", "inbound_nodes": [[["batchnormalization_288", 0, 0]]], "name": "convolution2d_287", "config": {"trainable": false, "b_regularizer": null, "name": "convolution2d_287", "init": "glorot_uniform", "b_constraint": null, "subsample": [1, 1], "border_mode": "valid", "nb_filter": 192, "W_regularizer": null, "W_constraint": null, "activity_regularizer": null, "activation": "relu", "dim_ordering": "tf", "nb_row": 3, "bias": true, "nb_col": 3}}, {"class_name": "BatchNormalization", "inbound_nodes": [[["convolution2d_287", 0, 0]]], "name": "batchnormalization_289", "config": {"mode": 0, "gamma_regularizer": null, "momentum": 0.99, "name": "batchnormalization_289", "beta_regularizer": null, "trainable": false, "epsilon": 1e-05, "axis": 3}}, {"class_name": "MaxPooling2D", "inbound_nodes": [[["batchnormalization_289", 0, 0]]], "name": "maxpooling2d_11", "config": {"pool_size": [3, 3], "trainable": false, "name": "maxpooling2d_11", "border_mode": "valid", "strides": [2, 2], "dim_ordering": "tf"}}, {"class_name": "Convolution2D", "inbound_nodes": [[["maxpooling2d_11", 0, 0]]], "name": "convolution2d_291", "config": {"trainable": false, "b_regularizer": null, "name": "convolution2d_291", "init": "glorot_uniform", "b_constraint": null, "subsample": [1, 1], "border_mode": "same", "nb_filter": 64, "W_regularizer": null, "W_constraint": null, "activity_regularizer": null, "activation": "relu", "dim_ordering": "tf", "nb_row": 1, "bias": true, "nb_col": 1}}, {"class_name": "BatchNormalization", "inbound_nodes": [[["convolution2d_291", 0, 0]]], "name": "batchnormalization_293", "config": {"mode": 0, "gamma_regularizer": null, "momentum": 0.99, "name": "batchnormalization_293", "beta_regularizer": null, "trainable": false, "epsilon": 1e-05, "axis": 3}}, {"class_name": "Convolution2D", "inbound_nodes": [[["maxpooling2d_11", 0, 0]]], "name": "convolution2d_289", "config": {"trainable": false, "b_regularizer": null, "name": "convolution2d_289", "init": "glorot_uniform", "b_constraint": null, "subsample": [1, 1], "border_mode": "same", "nb_filter": 48, "W_regularizer": null, "W_constraint": null, "activity_regularizer": null, "activation": "relu", "dim_ordering": "tf", "nb_row": 1, "bias": true, "nb_col": 1}}, {"class_name": "Convolution2D", "inbound_nodes": [[["batchnormalization_293", 0, 0]]], "name": "convolution2d_292", "config": {"trainable": false, "b_regularizer": null, "name": "convolution2d_292", "init": "glorot_uniform", "b_constraint": null, "subsample": [1, 1], "border_mode": "same", "nb_filter": 96, "W_regularizer": null, "W_constraint": null, "activity_regularizer": null, "activation": "relu", "dim_ordering": "tf", "nb_row": 3, "bias": true, "nb_col": 3}}, {"class_name": "BatchNormalization", "inbound_nodes": [[["convolution2d_289", 0, 0]]], "name": "batchnormalization_291", "config": {"mode": 0, "gamma_regularizer": null, "momentum": 0.99, "name": "batchnormalization_291", "beta_regularizer": null, "trainable": false, "epsilon": 1e-05, "axis": 3}}, {"class_name": "BatchNormalization", "inbound_nodes": [[["convolution2d_292", 0, 0]]], "name": "batchnormalization_294", "config": {"mode": 0, "gamma_regularizer": null, "momentum": 0.99, "name": "batchnormalization_294", "beta_regularizer": null, "trainable": false, "epsilon": 1e-05, "axis": 3}}, {"class_name": "AveragePooling2D", "inbound_nodes": [[["maxpooling2d_11", 0, 0]]], "name": "averagepooling2d_31", "config": {"pool_size": [3, 3], "trainable": false, "name": "averagepooling2d_31", "border_mode": "same", "strides": [1, 1], "dim_ordering": "tf"}}, {"class_name": "Convolution2D", "inbound_nodes": [[["maxpooling2d_11", 0, 0]]], "name": "convolution2d_288", "config": {"trainable": false, "b_regularizer": null, "name": "convolution2d_288", "init": "glorot_uniform", "b_constraint": null, "subsample": [1, 1], "border_mode": "same", "nb_filter": 64, "W_regularizer": null, "W_constraint": null, "activity_regularizer": null, "activation": "relu", "dim_ordering": "tf", "nb_row": 1, "bias": true, "nb_col": 1}}, {"class_name": "Convolution2D", "inbound_nodes": [[["batchnormalization_291", 0, 0]]], "name": "convolution2d_290", "config": {"trainable": false, "b_regularizer": null, "name": "convolution2d_290", "init": "glorot_uniform", "b_constraint": null, "subsample": [1, 1], "border_mode": "same", "nb_filter": 64, "W_regularizer": null, "W_constraint": null, "activity_regularizer": null, "activation": "relu", "dim_ordering": "tf", "nb_row": 5, "bias": true, "nb_col": 5}}, {"class_name": "Convolution2D", "inbound_nodes": [[["batchnormalization_294", 0, 0]]], "name": "convolution2d_293", "config": {"trainable": false, "b_regularizer": null, "name": "convolution2d_293", "init": "glorot_uniform", "b_constraint": null, "subsample": [1, 1], "border_mode": "same", "nb_filter": 96, "W_regularizer": null, "W_constraint": null, "activity_regularizer": null, "activation": "relu", "dim_ordering": "tf", "nb_row": 3, "bias": true, "nb_col": 3}}, {"class_name": "Convolution2D", "inbound_nodes": [[["averagepooling2d_31", 0, 0]]], "name": "convolution2d_294", "config": {"trainable": false, "b_regularizer": null, "name": "convolution2d_294", "init": "glorot_uniform", "b_constraint": null, "subsample": [1, 1], "border_mode": "same", "nb_filter": 32, "W_regularizer": null, "W_constraint": null, "activity_regularizer": null, "activation": "relu", "dim_ordering": "tf", "nb_row": 1, "bias": true, "nb_col": 1}}, {"class_name": "BatchNormalization", "inbound_nodes": [[["convolution2d_288", 0, 0]]], "name": "batchnormalization_290", "config": {"mode": 0, "gamma_regularizer": null, "momentum": 0.99, "name": "batchnormalization_290", "beta_regularizer": null, "trainable": false, "epsilon": 1e-05, "axis": 3}}, {"class_name": "BatchNormalization", "inbound_nodes": [[["convolution2d_290", 0, 0]]], "name": "batchnormalization_292", "config": {"mode": 0, "gamma_regularizer": null, "momentum": 0.99, "name": "batchnormalization_292", "beta_regularizer": null, "trainable": false, "epsilon": 1e-05, "axis": 3}}, {"class_name": "BatchNormalization", "inbound_nodes": [[["convolution2d_293", 0, 0]]], "name": "batchnormalization_295", "config": {"mode": 0, "gamma_regularizer": null, "momentum": 0.99, "name": "batchnormalization_295", "beta_regularizer": null, "trainable": false, "epsilon": 1e-05, "axis": 3}}, {"class_name": "BatchNormalization", "inbound_nodes": [[["convolution2d_294", 0, 0]]], "name": "batchnormalization_296", "config": {"mode": 0, "gamma_regularizer": null, "momentum": 0.99, "name": "batchnormalization_296", "beta_regularizer": null, "trainable": false, "epsilon": 1e-05, "axis": 3}}, {"class_name": "Merge", "inbound_nodes": [[["batchnormalization_290", 0, 0], ["batchnormalization_292", 0, 0], ["batchnormalization_295", 0, 0], ["batchnormalization_296", 0, 0]]], "name": "mixed0", "config": {"mode": "concat", "arguments": {}, "output_mask": null, "output_mask_type": "raw", "concat_axis": 3, "dot_axes": -1, "output_shape_type": "raw", "output_shape": null, "mode_type": "raw", "name": "mixed0"}}, {"class_name": "Convolution2D", "inbound_nodes": [[["mixed0", 0, 0]]], "name": "convolution2d_298", "config": {"trainable": false, "b_regularizer": null, "name": "convolution2d_298", "init": "glorot_uniform", "b_constraint": null, "subsample": [1, 1], "border_mode": "same", "nb_filter": 64, "W_regularizer": null, "W_constraint": null, "activity_regularizer": null, "activation": "relu", "dim_ordering": "tf", "nb_row": 1, "bias": true, "nb_col": 1}}, {"class_name": "BatchNormalization", "inbound_nodes": [[["convolution2d_298", 0, 0]]], "name": "batchnormalization_300", "config": {"mode": 0, "gamma_regularizer": null, "momentum": 0.99, "name": "batchnormalization_300", "beta_regularizer": null, "trainable": false, "epsilon": 1e-05, "axis": 3}}, {"class_name": "Convolution2D", "inbound_nodes": [[["mixed0", 0, 0]]], "name": "convolution2d_296", "config": {"trainable": false, "b_regularizer": null, "name": "convolution2d_296", "init": "glorot_uniform", "b_constraint": null, "subsample": [1, 1], "border_mode": "same", "nb_filter": 48, "W_regularizer": null, "W_constraint": null, "activity_regularizer": null, "activation": "relu", "dim_ordering": "tf", "nb_row": 1, "bias": true, "nb_col": 1}}, {"class_name": "Convolution2D", "inbound_nodes": [[["batchnormalization_300", 0, 0]]], "name": "convolution2d_299", "config": {"trainable": false, "b_regularizer": null, "name": "convolution2d_299", "init": "glorot_uniform", "b_constraint": null, "subsample": [1, 1], "border_mode": "same", "nb_filter": 96, "W_regularizer": null, "W_constraint": null, "activity_regularizer": null, "activation": "relu", "dim_ordering": "tf", "nb_row": 3, "bias": true, "nb_col": 3}}, {"class_name": "BatchNormalization", "inbound_nodes": [[["convolution2d_296", 0, 0]]], "name": "batchnormalization_298", "config": {"mode": 0, "gamma_regularizer": null, "momentum": 0.99, "name": "batchnormalization_298", "beta_regularizer": null, "trainable": false, "epsilon": 1e-05, "axis": 3}}, {"class_name": "BatchNormalization", "inbound_nodes": [[["convolution2d_299", 0, 0]]], "name": "batchnormalization_301", "config": {"mode": 0, "gamma_regularizer": null, "momentum": 0.99, "name": "batchnormalization_301", "beta_regularizer": null, "trainable": false, "epsilon": 1e-05, "axis": 3}}, {"class_name": "AveragePooling2D", "inbound_nodes": [[["mixed0", 0, 0]]], "name": "averagepooling2d_32", "config": {"pool_size": [3, 3], "trainable": false, "name": "averagepooling2d_32", "border_mode": "same", "strides": [1, 1], "dim_ordering": "tf"}}, {"class_name": "Convolution2D", "inbound_nodes": [[["mixed0", 0, 0]]], "name": "convolution2d_295", "config": {"trainable": false, "b_regularizer": null, "name": "convolution2d_295", "init": "glorot_uniform", "b_constraint": null, "subsample": [1, 1], "border_mode": "same", "nb_filter": 64, "W_regularizer": null, "W_constraint": null, "activity_regularizer": null, "activation": "relu", "dim_ordering": "tf", "nb_row": 1, "bias": true, "nb_col": 1}}, {"class_name": "Convolution2D", "inbound_nodes": [[["batchnormalization_298", 0, 0]]], "name": "convolution2d_297", "config": {"trainable": false, "b_regularizer": null, "name": "convolution2d_297", "init": "glorot_uniform", "b_constraint": null, "subsample": [1, 1], "border_mode": "same", "nb_filter": 64, "W_regularizer": null, "W_constraint": null, "activity_regularizer": null, "activation": "relu", "dim_ordering": "tf", "nb_row": 5, "bias": true, "nb_col": 5}}, {"class_name": "Convolution2D", "inbound_nodes": [[["batchnormalization_301", 0, 0]]], "name": "convolution2d_300", "config": {"trainable": false, "b_regularizer": null, "name": "convolution2d_300", "init": "glorot_uniform", "b_constraint": null, "subsample": [1, 1], "border_mode": "same", "nb_filter": 96, "W_regularizer": null, "W_constraint": null, "activity_regularizer": null, "activation": "relu", "dim_ordering": "tf", "nb_row": 3, "bias": true, "nb_col": 3}}, {"class_name": "Convolution2D", "inbound_nodes": [[["averagepooling2d_32", 0, 0]]], "name": "convolution2d_301", "config": {"trainable": false, "b_regularizer": null, "name": "convolution2d_301", "init": "glorot_uniform", "b_constraint": null, "subsample": [1, 1], "border_mode": "same", "nb_filter": 32, "W_regularizer": null, "W_constraint": null, "activity_regularizer": null, "activation": "relu", "dim_ordering": "tf", "nb_row": 1, "bias": true, "nb_col": 1}}, {"class_name": "BatchNormalization", "inbound_nodes": [[["convolution2d_295", 0, 0]]], "name": "batchnormalization_297", "config": {"mode": 0, "gamma_regularizer": null, "momentum": 0.99, "name": "batchnormalization_297", "beta_regularizer": null, "trainable": false, "epsilon": 1e-05, "axis": 3}}, {"class_name": "BatchNormalization", "inbound_nodes": [[["convolution2d_297", 0, 0]]], "name": "batchnormalization_299", "config": {"mode": 0, "gamma_regularizer": null, "momentum": 0.99, "name": "batchnormalization_299", "beta_regularizer": null, "trainable": false, "epsilon": 1e-05, "axis": 3}}, {"class_name": "BatchNormalization", "inbound_nodes": [[["convolution2d_300", 0, 0]]], "name": "batchnormalization_302", "config": {"mode": 0, "gamma_regularizer": null, "momentum": 0.99, "name": "batchnormalization_302", "beta_regularizer": null, "trainable": false, "epsilon": 1e-05, "axis": 3}}, {"class_name": "BatchNormalization", "inbound_nodes": [[["convolution2d_301", 0, 0]]], "name": "batchnormalization_303", "config": {"mode": 0, "gamma_regularizer": null, "momentum": 0.99, "name": "batchnormalization_303", "beta_regularizer": null, "trainable": false, "epsilon": 1e-05, "axis": 3}}, {"class_name": "Merge", "inbound_nodes": [[["batchnormalization_297", 0, 0], ["batchnormalization_299", 0, 0], ["batchnormalization_302", 0, 0], ["batchnormalization_303", 0, 0]]], "name": "mixed1", "config": {"mode": "concat", "arguments": {}, "output_mask": null, "output_mask_type": "raw", "concat_axis": 3, "dot_axes": -1, "output_shape_type": "raw", "output_shape": null, "mode_type": "raw", "name": "mixed1"}}, {"class_name": "Convolution2D", "inbound_nodes": [[["mixed1", 0, 0]]], "name": "convolution2d_305", "config": {"trainable": false, "b_regularizer": null, "name": "convolution2d_305", "init": "glorot_uniform", "b_constraint": null, "subsample": [1, 1], "border_mode": "same", "nb_filter": 64, "W_regularizer": null, "W_constraint": null, "activity_regularizer": null, "activation": "relu", "dim_ordering": "tf", "nb_row": 1, "bias": true, "nb_col": 1}}, {"class_name": "BatchNormalization", "inbound_nodes": [[["convolution2d_305", 0, 0]]], "name": "batchnormalization_307", "config": {"mode": 0, "gamma_regularizer": null, "momentum": 0.99, "name": "batchnormalization_307", "beta_regularizer": null, "trainable": false, "epsilon": 1e-05, "axis": 3}}, {"class_name": "Convolution2D", "inbound_nodes": [[["mixed1", 0, 0]]], "name": "convolution2d_303", "config": {"trainable": false, "b_regularizer": null, "name": "convolution2d_303", "init": "glorot_uniform", "b_constraint": null, "subsample": [1, 1], "border_mode": "same", "nb_filter": 48, "W_regularizer": null, "W_constraint": null, "activity_regularizer": null, "activation": "relu", "dim_ordering": "tf", "nb_row": 1, "bias": true, "nb_col": 1}}, {"class_name": "Convolution2D", "inbound_nodes": [[["batchnormalization_307", 0, 0]]], "name": "convolution2d_306", "config": {"trainable": false, "b_regularizer": null, "name": "convolution2d_306", "init": "glorot_uniform", "b_constraint": null, "subsample": [1, 1], "border_mode": "same", "nb_filter": 96, "W_regularizer": null, "W_constraint": null, "activity_regularizer": null, "activation": "relu", "dim_ordering": "tf", "nb_row": 3, "bias": true, "nb_col": 3}}, {"class_name": "BatchNormalization", "inbound_nodes": [[["convolution2d_303", 0, 0]]], "name": "batchnormalization_305", "config": {"mode": 0, "gamma_regularizer": null, "momentum": 0.99, "name": "batchnormalization_305", "beta_regularizer": null, "trainable": false, "epsilon": 1e-05, "axis": 3}}, {"class_name": "BatchNormalization", "inbound_nodes": [[["convolution2d_306", 0, 0]]], "name": "batchnormalization_308", "config": {"mode": 0, "gamma_regularizer": null, "momentum": 0.99, "name": "batchnormalization_308", "beta_regularizer": null, "trainable": false, "epsilon": 1e-05, "axis": 3}}, {"class_name": "AveragePooling2D", "inbound_nodes": [[["mixed1", 0, 0]]], "name": "averagepooling2d_33", "config": {"pool_size": [3, 3], "trainable": false, "name": "averagepooling2d_33", "border_mode": "same", "strides": [1, 1], "dim_ordering": "tf"}}, {"class_name": "Convolution2D", "inbound_nodes": [[["mixed1", 0, 0]]], "name": "convolution2d_302", "config": {"trainable": false, "b_regularizer": null, "name": "convolution2d_302", "init": "glorot_uniform", "b_constraint": null, "subsample": [1, 1], "border_mode": "same", "nb_filter": 64, "W_regularizer": null, "W_constraint": null, "activity_regularizer": null, "activation": "relu", "dim_ordering": "tf", "nb_row": 1, "bias": true, "nb_col": 1}}, {"class_name": "Convolution2D", "inbound_nodes": [[["batchnormalization_305", 0, 0]]], "name": "convolution2d_304", "config": {"trainable": false, "b_regularizer": null, "name": "convolution2d_304", "init": "glorot_uniform", "b_constraint": null, "subsample": [1, 1], "border_mode": "same", "nb_filter": 64, "W_regularizer": null, "W_constraint": null, "activity_regularizer": null, "activation": "relu", "dim_ordering": "tf", "nb_row": 5, "bias": true, "nb_col": 5}}, {"class_name": "Convolution2D", "inbound_nodes": [[["batchnormalization_308", 0, 0]]], "name": "convolution2d_307", "config": {"trainable": false, "b_regularizer": null, "name": "convolution2d_307", "init": "glorot_uniform", "b_constraint": null, "subsample": [1, 1], "border_mode": "same", "nb_filter": 96, "W_regularizer": null, "W_constraint": null, "activity_regularizer": null, "activation": "relu", "dim_ordering": "tf", "nb_row": 3, "bias": true, "nb_col": 3}}, {"class_name": "Convolution2D", "inbound_nodes": [[["averagepooling2d_33", 0, 0]]], "name": "convolution2d_308", "config": {"trainable": false, "b_regularizer": null, "name": "convolution2d_308", "init": "glorot_uniform", "b_constraint": null, "subsample": [1, 1], "border_mode": "same", "nb_filter": 32, "W_regularizer": null, "W_constraint": null, "activity_regularizer": null, "activation": "relu", "dim_ordering": "tf", "nb_row": 1, "bias": true, "nb_col": 1}}, {"class_name": "BatchNormalization", "inbound_nodes": [[["convolution2d_302", 0, 0]]], "name": "batchnormalization_304", "config": {"mode": 0, "gamma_regularizer": null, "momentum": 0.99, "name": "batchnormalization_304", "beta_regularizer": null, "trainable": false, "epsilon": 1e-05, "axis": 3}}, {"class_name": "BatchNormalization", "inbound_nodes": [[["convolution2d_304", 0, 0]]], "name": "batchnormalization_306", "config": {"mode": 0, "gamma_regularizer": null, "momentum": 0.99, "name": "batchnormalization_306", "beta_regularizer": null, "trainable": false, "epsilon": 1e-05, "axis": 3}}, {"class_name": "BatchNormalization", "inbound_nodes": [[["convolution2d_307", 0, 0]]], "name": "batchnormalization_309", "config": {"mode": 0, "gamma_regularizer": null, "momentum": 0.99, "name": "batchnormalization_309", "beta_regularizer": null, "trainable": false, "epsilon": 1e-05, "axis": 3}}, {"class_name": "BatchNormalization", "inbound_nodes": [[["convolution2d_308", 0, 0]]], "name": "batchnormalization_310", "config": {"mode": 0, "gamma_regularizer": null, "momentum": 0.99, "name": "batchnormalization_310", "beta_regularizer": null, "trainable": false, "epsilon": 1e-05, "axis": 3}}, {"class_name": "Merge", "inbound_nodes": [[["batchnormalization_304", 0, 0], ["batchnormalization_306", 0, 0], ["batchnormalization_309", 0, 0], ["batchnormalization_310", 0, 0]]], "name": "mixed2", "config": {"mode": "concat", "arguments": {}, "output_mask": null, "output_mask_type": "raw", "concat_axis": 3, "dot_axes": -1, "output_shape_type": "raw", "output_shape": null, "mode_type": "raw", "name": "mixed2"}}, {"class_name": "Convolution2D", "inbound_nodes": [[["mixed2", 0, 0]]], "name": "convolution2d_310", "config": {"trainable": false, "b_regularizer": null, "name": "convolution2d_310", "init": "glorot_uniform", "b_constraint": null, "subsample": [1, 1], "border_mode": "same", "nb_filter": 64, "W_regularizer": null, "W_constraint": null, "activity_regularizer": null, "activation": "relu", "dim_ordering": "tf", "nb_row": 1, "bias": true, "nb_col": 1}}, {"class_name": "BatchNormalization", "inbound_nodes": [[["convolution2d_310", 0, 0]]], "name": "batchnormalization_312", "config": {"mode": 0, "gamma_regularizer": null, "momentum": 0.99, "name": "batchnormalization_312", "beta_regularizer": null, "trainable": false, "epsilon": 1e-05, "axis": 3}}, {"class_name": "Convolution2D", "inbound_nodes": [[["batchnormalization_312", 0, 0]]], "name": "convolution2d_311", "config": {"trainable": false, "b_regularizer": null, "name": "convolution2d_311", "init": "glorot_uniform", "b_constraint": null, "subsample": [1, 1], "border_mode": "same", "nb_filter": 96, "W_regularizer": null, "W_constraint": null, "activity_regularizer": null, "activation": "relu", "dim_ordering": "tf", "nb_row": 3, "bias": true, "nb_col": 3}}, {"class_name": "BatchNormalization", "inbound_nodes": [[["convolution2d_311", 0, 0]]], "name": "batchnormalization_313", "config": {"mode": 0, "gamma_regularizer": null, "momentum": 0.99, "name": "batchnormalization_313", "beta_regularizer": null, "trainable": false, "epsilon": 1e-05, "axis": 3}}, {"class_name": "Convolution2D", "inbound_nodes": [[["mixed2", 0, 0]]], "name": "convolution2d_309", "config": {"trainable": false, "b_regularizer": null, "name": "convolution2d_309", "init": "glorot_uniform", "b_constraint": null, "subsample": [2, 2], "border_mode": "valid", "nb_filter": 384, "W_regularizer": null, "W_constraint": null, "activity_regularizer": null, "activation": "relu", "dim_ordering": "tf", "nb_row": 3, "bias": true, "nb_col": 3}}, {"class_name": "Convolution2D", "inbound_nodes": [[["batchnormalization_313", 0, 0]]], "name": "convolution2d_312", "config": {"trainable": false, "b_regularizer": null, "name": "convolution2d_312", "init": "glorot_uniform", "b_constraint": null, "subsample": [2, 2], "border_mode": "valid", "nb_filter": 96, "W_regularizer": null, "W_constraint": null, "activity_regularizer": null, "activation": "relu", "dim_ordering": "tf", "nb_row": 3, "bias": true, "nb_col": 3}}, {"class_name": "BatchNormalization", "inbound_nodes": [[["convolution2d_309", 0, 0]]], "name": "batchnormalization_311", "config": {"mode": 0, "gamma_regularizer": null, "momentum": 0.99, "name": "batchnormalization_311", "beta_regularizer": null, "trainable": false, "epsilon": 1e-05, "axis": 3}}, {"class_name": "BatchNormalization", "inbound_nodes": [[["convolution2d_312", 0, 0]]], "name": "batchnormalization_314", "config": {"mode": 0, "gamma_regularizer": null, "momentum": 0.99, "name": "batchnormalization_314", "beta_regularizer": null, "trainable": false, "epsilon": 1e-05, "axis": 3}}, {"class_name": "MaxPooling2D", "inbound_nodes": [[["mixed2", 0, 0]]], "name": "maxpooling2d_12", "config": {"pool_size": [3, 3], "trainable": false, "name": "maxpooling2d_12", "border_mode": "valid", "strides": [2, 2], "dim_ordering": "tf"}}, {"class_name": "Merge", "inbound_nodes": [[["batchnormalization_311", 0, 0], ["batchnormalization_314", 0, 0], ["maxpooling2d_12", 0, 0]]], "name": "mixed3", "config": {"mode": "concat", "arguments": {}, "output_mask": null, "output_mask_type": "raw", "concat_axis": 3, "dot_axes": -1, "output_shape_type": "raw", "output_shape": null, "mode_type": "raw", "name": "mixed3"}}, {"class_name": "Convolution2D", "inbound_nodes": [[["mixed3", 0, 0]]], "name": "convolution2d_317", "config": {"trainable": false, "b_regularizer": null, "name": "convolution2d_317", "init": "glorot_uniform", "b_constraint": null, "subsample": [1, 1], "border_mode": "same", "nb_filter": 128, "W_regularizer": null, "W_constraint": null, "activity_regularizer": null, "activation": "relu", "dim_ordering": "tf", "nb_row": 1, "bias": true, "nb_col": 1}}, {"class_name": "BatchNormalization", "inbound_nodes": [[["convolution2d_317", 0, 0]]], "name": "batchnormalization_319", "config": {"mode": 0, "gamma_regularizer": null, "momentum": 0.99, "name": "batchnormalization_319", "beta_regularizer": null, "trainable": false, "epsilon": 1e-05, "axis": 3}}, {"class_name": "Convolution2D", "inbound_nodes": [[["batchnormalization_319", 0, 0]]], "name": "convolution2d_318", "config": {"trainable": false, "b_regularizer": null, "name": "convolution2d_318", "init": "glorot_uniform", "b_constraint": null, "subsample": [1, 1], "border_mode": "same", "nb_filter": 128, "W_regularizer": null, "W_constraint": null, "activity_regularizer": null, "activation": "relu", "dim_ordering": "tf", "nb_row": 7, "bias": true, "nb_col": 1}}, {"class_name": "BatchNormalization", "inbound_nodes": [[["convolution2d_318", 0, 0]]], "name": "batchnormalization_320", "config": {"mode": 0, "gamma_regularizer": null, "momentum": 0.99, "name": "batchnormalization_320", "beta_regularizer": null, "trainable": false, "epsilon": 1e-05, "axis": 3}}, {"class_name": "Convolution2D", "inbound_nodes": [[["mixed3", 0, 0]]], "name": "convolution2d_314", "config": {"trainable": false, "b_regularizer": null, "name": "convolution2d_314", "init": "glorot_uniform", "b_constraint": null, "subsample": [1, 1], "border_mode": "same", "nb_filter": 128, "W_regularizer": null, "W_constraint": null, "activity_regularizer": null, "activation": "relu", "dim_ordering": "tf", "nb_row": 1, "bias": true, "nb_col": 1}}, {"class_name": "Convolution2D", "inbound_nodes": [[["batchnormalization_320", 0, 0]]], "name": "convolution2d_319", "config": {"trainable": false, "b_regularizer": null, "name": "convolution2d_319", "init": "glorot_uniform", "b_constraint": null, "subsample": [1, 1], "border_mode": "same", "nb_filter": 128, "W_regularizer": null, "W_constraint": null, "activity_regularizer": null, "activation": "relu", "dim_ordering": "tf", "nb_row": 1, "bias": true, "nb_col": 7}}, {"class_name": "BatchNormalization", "inbound_nodes": [[["convolution2d_314", 0, 0]]], "name": "batchnormalization_316", "config": {"mode": 0, "gamma_regularizer": null, "momentum": 0.99, "name": "batchnormalization_316", "beta_regularizer": null, "trainable": false, "epsilon": 1e-05, "axis": 3}}, {"class_name": "BatchNormalization", "inbound_nodes": [[["convolution2d_319", 0, 0]]], "name": "batchnormalization_321", "config": {"mode": 0, "gamma_regularizer": null, "momentum": 0.99, "name": "batchnormalization_321", "beta_regularizer": null, "trainable": false, "epsilon": 1e-05, "axis": 3}}, {"class_name": "Convolution2D", "inbound_nodes": [[["batchnormalization_316", 0, 0]]], "name": "convolution2d_315", "config": {"trainable": false, "b_regularizer": null, "name": "convolution2d_315", "init": "glorot_uniform", "b_constraint": null, "subsample": [1, 1], "border_mode": "same", "nb_filter": 128, "W_regularizer": null, "W_constraint": null, "activity_regularizer": null, "activation": "relu", "dim_ordering": "tf", "nb_row": 1, "bias": true, "nb_col": 7}}, {"class_name": "Convolution2D", "inbound_nodes": [[["batchnormalization_321", 0, 0]]], "name": "convolution2d_320", "config": {"trainable": false, "b_regularizer": null, "name": "convolution2d_320", "init": "glorot_uniform", "b_constraint": null, "subsample": [1, 1], "border_mode": "same", "nb_filter": 128, "W_regularizer": null, "W_constraint": null, "activity_regularizer": null, "activation": "relu", "dim_ordering": "tf", "nb_row": 7, "bias": true, "nb_col": 1}}, {"class_name": "BatchNormalization", "inbound_nodes": [[["convolution2d_315", 0, 0]]], "name": "batchnormalization_317", "config": {"mode": 0, "gamma_regularizer": null, "momentum": 0.99, "name": "batchnormalization_317", "beta_regularizer": null, "trainable": false, "epsilon": 1e-05, "axis": 3}}, {"class_name": "BatchNormalization", "inbound_nodes": [[["convolution2d_320", 0, 0]]], "name": "batchnormalization_322", "config": {"mode": 0, "gamma_regularizer": null, "momentum": 0.99, "name": "batchnormalization_322", "beta_regularizer": null, "trainable": false, "epsilon": 1e-05, "axis": 3}}, {"class_name": "AveragePooling2D", "inbound_nodes": [[["mixed3", 0, 0]]], "name": "averagepooling2d_34", "config": {"pool_size": [3, 3], "trainable": false, "name": "averagepooling2d_34", "border_mode": "same", "strides": [1, 1], "dim_ordering": "tf"}}, {"class_name": "Convolution2D", "inbound_nodes": [[["mixed3", 0, 0]]], "name": "convolution2d_313", "config": {"trainable": false, "b_regularizer": null, "name": "convolution2d_313", "init": "glorot_uniform", "b_constraint": null, "subsample": [1, 1], "border_mode": "same", "nb_filter": 192, "W_regularizer": null, "W_constraint": null, "activity_regularizer": null, "activation": "relu", "dim_ordering": "tf", "nb_row": 1, "bias": true, "nb_col": 1}}, {"class_name": "Convolution2D", "inbound_nodes": [[["batchnormalization_317", 0, 0]]], "name": "convolution2d_316", "config": {"trainable": false, "b_regularizer": null, "name": "convolution2d_316", "init": "glorot_uniform", "b_constraint": null, "subsample": [1, 1], "border_mode": "same", "nb_filter": 192, "W_regularizer": null, "W_constraint": null, "activity_regularizer": null, "activation": "relu", "dim_ordering": "tf", "nb_row": 7, "bias": true, "nb_col": 1}}, {"class_name": "Convolution2D", "inbound_nodes": [[["batchnormalization_322", 0, 0]]], "name": "convolution2d_321", "config": {"trainable": false, "b_regularizer": null, "name": "convolution2d_321", "init": "glorot_uniform", "b_constraint": null, "subsample": [1, 1], "border_mode": "same", "nb_filter": 192, "W_regularizer": null, "W_constraint": null, "activity_regularizer": null, "activation": "relu", "dim_ordering": "tf", "nb_row": 1, "bias": true, "nb_col": 7}}, {"class_name": "Convolution2D", "inbound_nodes": [[["averagepooling2d_34", 0, 0]]], "name": "convolution2d_322", "config": {"trainable": false, "b_regularizer": null, "name": "convolution2d_322", "init": "glorot_uniform", "b_constraint": null, "subsample": [1, 1], "border_mode": "same", "nb_filter": 192, "W_regularizer": null, "W_constraint": null, "activity_regularizer": null, "activation": "relu", "dim_ordering": "tf", "nb_row": 1, "bias": true, "nb_col": 1}}, {"class_name": "BatchNormalization", "inbound_nodes": [[["convolution2d_313", 0, 0]]], "name": "batchnormalization_315", "config": {"mode": 0, "gamma_regularizer": null, "momentum": 0.99, "name": "batchnormalization_315", "beta_regularizer": null, "trainable": false, "epsilon": 1e-05, "axis": 3}}, {"class_name": "BatchNormalization", "inbound_nodes": [[["convolution2d_316", 0, 0]]], "name": "batchnormalization_318", "config": {"mode": 0, "gamma_regularizer": null, "momentum": 0.99, "name": "batchnormalization_318", "beta_regularizer": null, "trainable": false, "epsilon": 1e-05, "axis": 3}}, {"class_name": "BatchNormalization", "inbound_nodes": [[["convolution2d_321", 0, 0]]], "name": "batchnormalization_323", "config": {"mode": 0, "gamma_regularizer": null, "momentum": 0.99, "name": "batchnormalization_323", "beta_regularizer": null, "trainable": false, "epsilon": 1e-05, "axis": 3}}, {"class_name": "BatchNormalization", "inbound_nodes": [[["convolution2d_322", 0, 0]]], "name": "batchnormalization_324", "config": {"mode": 0, "gamma_regularizer": null, "momentum": 0.99, "name": "batchnormalization_324", "beta_regularizer": null, "trainable": false, "epsilon": 1e-05, "axis": 3}}, {"class_name": "Merge", "inbound_nodes": [[["batchnormalization_315", 0, 0], ["batchnormalization_318", 0, 0], ["batchnormalization_323", 0, 0], ["batchnormalization_324", 0, 0]]], "name": "mixed4", "config": {"mode": "concat", "arguments": {}, "output_mask": null, "output_mask_type": "raw", "concat_axis": 3, "dot_axes": -1, "output_shape_type": "raw", "output_shape": null, "mode_type": "raw", "name": "mixed4"}}, {"class_name": "Convolution2D", "inbound_nodes": [[["mixed4", 0, 0]]], "name": "convolution2d_327", "config": {"trainable": false, "b_regularizer": null, "name": "convolution2d_327", "init": "glorot_uniform", "b_constraint": null, "subsample": [1, 1], "border_mode": "same", "nb_filter": 160, "W_regularizer": null, "W_constraint": null, "activity_regularizer": null, "activation": "relu", "dim_ordering": "tf", "nb_row": 1, "bias": true, "nb_col": 1}}, {"class_name": "BatchNormalization", "inbound_nodes": [[["convolution2d_327", 0, 0]]], "name": "batchnormalization_329", "config": {"mode": 0, "gamma_regularizer": null, "momentum": 0.99, "name": "batchnormalization_329", "beta_regularizer": null, "trainable": false, "epsilon": 1e-05, "axis": 3}}, {"class_name": "Convolution2D", "inbound_nodes": [[["batchnormalization_329", 0, 0]]], "name": "convolution2d_328", "config": {"trainable": false, "b_regularizer": null, "name": "convolution2d_328", "init": "glorot_uniform", "b_constraint": null, "subsample": [1, 1], "border_mode": "same", "nb_filter": 160, "W_regularizer": null, "W_constraint": null, "activity_regularizer": null, "activation": "relu", "dim_ordering": "tf", "nb_row": 7, "bias": true, "nb_col": 1}}, {"class_name": "BatchNormalization", "inbound_nodes": [[["convolution2d_328", 0, 0]]], "name": "batchnormalization_330", "config": {"mode": 0, "gamma_regularizer": null, "momentum": 0.99, "name": "batchnormalization_330", "beta_regularizer": null, "trainable": false, "epsilon": 1e-05, "axis": 3}}, {"class_name": "Convolution2D", "inbound_nodes": [[["mixed4", 0, 0]]], "name": "convolution2d_324", "config": {"trainable": false, "b_regularizer": null, "name": "convolution2d_324", "init": "glorot_uniform", "b_constraint": null, "subsample": [1, 1], "border_mode": "same", "nb_filter": 160, "W_regularizer": null, "W_constraint": null, "activity_regularizer": null, "activation": "relu", "dim_ordering": "tf", "nb_row": 1, "bias": true, "nb_col": 1}}, {"class_name": "Convolution2D", "inbound_nodes": [[["batchnormalization_330", 0, 0]]], "name": "convolution2d_329", "config": {"trainable": false, "b_regularizer": null, "name": "convolution2d_329", "init": "glorot_uniform", "b_constraint": null, "subsample": [1, 1], "border_mode": "same", "nb_filter": 160, "W_regularizer": null, "W_constraint": null, "activity_regularizer": null, "activation": "relu", "dim_ordering": "tf", "nb_row": 1, "bias": true, "nb_col": 7}}, {"class_name": "BatchNormalization", "inbound_nodes": [[["convolution2d_324", 0, 0]]], "name": "batchnormalization_326", "config": {"mode": 0, "gamma_regularizer": null, "momentum": 0.99, "name": "batchnormalization_326", "beta_regularizer": null, "trainable": false, "epsilon": 1e-05, "axis": 3}}, {"class_name": "BatchNormalization", "inbound_nodes": [[["convolution2d_329", 0, 0]]], "name": "batchnormalization_331", "config": {"mode": 0, "gamma_regularizer": null, "momentum": 0.99, "name": "batchnormalization_331", "beta_regularizer": null, "trainable": false, "epsilon": 1e-05, "axis": 3}}, {"class_name": "Convolution2D", "inbound_nodes": [[["batchnormalization_326", 0, 0]]], "name": "convolution2d_325", "config": {"trainable": false, "b_regularizer": null, "name": "convolution2d_325", "init": "glorot_uniform", "b_constraint": null, "subsample": [1, 1], "border_mode": "same", "nb_filter": 160, "W_regularizer": null, "W_constraint": null, "activity_regularizer": null, "activation": "relu", "dim_ordering": "tf", "nb_row": 1, "bias": true, "nb_col": 7}}, {"class_name": "Convolution2D", "inbound_nodes": [[["batchnormalization_331", 0, 0]]], "name": "convolution2d_330", "config": {"trainable": false, "b_regularizer": null, "name": "convolution2d_330", "init": "glorot_uniform", "b_constraint": null, "subsample": [1, 1], "border_mode": "same", "nb_filter": 160, "W_regularizer": null, "W_constraint": null, "activity_regularizer": null, "activation": "relu", "dim_ordering": "tf", "nb_row": 7, "bias": true, "nb_col": 1}}, {"class_name": "BatchNormalization", "inbound_nodes": [[["convolution2d_325", 0, 0]]], "name": "batchnormalization_327", "config": {"mode": 0, "gamma_regularizer": null, "momentum": 0.99, "name": "batchnormalization_327", "beta_regularizer": null, "trainable": false, "epsilon": 1e-05, "axis": 3}}, {"class_name": "BatchNormalization", "inbound_nodes": [[["convolution2d_330", 0, 0]]], "name": "batchnormalization_332", "config": {"mode": 0, "gamma_regularizer": null, "momentum": 0.99, "name": "batchnormalization_332", "beta_regularizer": null, "trainable": false, "epsilon": 1e-05, "axis": 3}}, {"class_name": "AveragePooling2D", "inbound_nodes": [[["mixed4", 0, 0]]], "name": "averagepooling2d_35", "config": {"pool_size": [3, 3], "trainable": false, "name": "averagepooling2d_35", "border_mode": "same", "strides": [1, 1], "dim_ordering": "tf"}}, {"class_name": "Convolution2D", "inbound_nodes": [[["mixed4", 0, 0]]], "name": "convolution2d_323", "config": {"trainable": false, "b_regularizer": null, "name": "convolution2d_323", "init": "glorot_uniform", "b_constraint": null, "subsample": [1, 1], "border_mode": "same", "nb_filter": 192, "W_regularizer": null, "W_constraint": null, "activity_regularizer": null, "activation": "relu", "dim_ordering": "tf", "nb_row": 1, "bias": true, "nb_col": 1}}, {"class_name": "Convolution2D", "inbound_nodes": [[["batchnormalization_327", 0, 0]]], "name": "convolution2d_326", "config": {"trainable": false, "b_regularizer": null, "name": "convolution2d_326", "init": "glorot_uniform", "b_constraint": null, "subsample": [1, 1], "border_mode": "same", "nb_filter": 192, "W_regularizer": null, "W_constraint": null, "activity_regularizer": null, "activation": "relu", "dim_ordering": "tf", "nb_row": 7, "bias": true, "nb_col": 1}}, {"class_name": "Convolution2D", "inbound_nodes": [[["batchnormalization_332", 0, 0]]], "name": "convolution2d_331", "config": {"trainable": false, "b_regularizer": null, "name": "convolution2d_331", "init": "glorot_uniform", "b_constraint": null, "subsample": [1, 1], "border_mode": "same", "nb_filter": 192, "W_regularizer": null, "W_constraint": null, "activity_regularizer": null, "activation": "relu", "dim_ordering": "tf", "nb_row": 1, "bias": true, "nb_col": 7}}, {"class_name": "Convolution2D", "inbound_nodes": [[["averagepooling2d_35", 0, 0]]], "name": "convolution2d_332", "config": {"trainable": false, "b_regularizer": null, "name": "convolution2d_332", "init": "glorot_uniform", "b_constraint": null, "subsample": [1, 1], "border_mode": "same", "nb_filter": 192, "W_regularizer": null, "W_constraint": null, "activity_regularizer": null, "activation": "relu", "dim_ordering": "tf", "nb_row": 1, "bias": true, "nb_col": 1}}, {"class_name": "BatchNormalization", "inbound_nodes": [[["convolution2d_323", 0, 0]]], "name": "batchnormalization_325", "config": {"mode": 0, "gamma_regularizer": null, "momentum": 0.99, "name": "batchnormalization_325", "beta_regularizer": null, "trainable": false, "epsilon": 1e-05, "axis": 3}}, {"class_name": "BatchNormalization", "inbound_nodes": [[["convolution2d_326", 0, 0]]], "name": "batchnormalization_328", "config": {"mode": 0, "gamma_regularizer": null, "momentum": 0.99, "name": "batchnormalization_328", "beta_regularizer": null, "trainable": false, "epsilon": 1e-05, "axis": 3}}, {"class_name": "BatchNormalization", "inbound_nodes": [[["convolution2d_331", 0, 0]]], "name": "batchnormalization_333", "config": {"mode": 0, "gamma_regularizer": null, "momentum": 0.99, "name": "batchnormalization_333", "beta_regularizer": null, "trainable": false, "epsilon": 1e-05, "axis": 3}}, {"class_name": "BatchNormalization", "inbound_nodes": [[["convolution2d_332", 0, 0]]], "name": "batchnormalization_334", "config": {"mode": 0, "gamma_regularizer": null, "momentum": 0.99, "name": "batchnormalization_334", "beta_regularizer": null, "trainable": false, "epsilon": 1e-05, "axis": 3}}, {"class_name": "Merge", "inbound_nodes": [[["batchnormalization_325", 0, 0], ["batchnormalization_328", 0, 0], ["batchnormalization_333", 0, 0], ["batchnormalization_334", 0, 0]]], "name": "mixed5", "config": {"mode": "concat", "arguments": {}, "output_mask": null, "output_mask_type": "raw", "concat_axis": 3, "dot_axes": -1, "output_shape_type": "raw", "output_shape": null, "mode_type": "raw", "name": "mixed5"}}, {"class_name": "Convolution2D", "inbound_nodes": [[["mixed5", 0, 0]]], "name": "convolution2d_337", "config": {"trainable": true, "b_regularizer": null, "name": "convolution2d_337", "init": "glorot_uniform", "b_constraint": null, "subsample": [1, 1], "border_mode": "same", "nb_filter": 160, "W_regularizer": null, "W_constraint": null, "activity_regularizer": null, "activation": "relu", "dim_ordering": "tf", "nb_row": 1, "bias": true, "nb_col": 1}}, {"class_name": "BatchNormalization", "inbound_nodes": [[["convolution2d_337", 0, 0]]], "name": "batchnormalization_339", "config": {"mode": 0, "gamma_regularizer": null, "momentum": 0.99, "name": "batchnormalization_339", "beta_regularizer": null, "trainable": true, "epsilon": 1e-05, "axis": 3}}, {"class_name": "Convolution2D", "inbound_nodes": [[["batchnormalization_339", 0, 0]]], "name": "convolution2d_338", "config": {"trainable": true, "b_regularizer": null, "name": "convolution2d_338", "init": "glorot_uniform", "b_constraint": null, "subsample": [1, 1], "border_mode": "same", "nb_filter": 160, "W_regularizer": null, "W_constraint": null, "activity_regularizer": null, "activation": "relu", "dim_ordering": "tf", "nb_row": 7, "bias": true, "nb_col": 1}}, {"class_name": "BatchNormalization", "inbound_nodes": [[["convolution2d_338", 0, 0]]], "name": "batchnormalization_340", "config": {"mode": 0, "gamma_regularizer": null, "momentum": 0.99, "name": "batchnormalization_340", "beta_regularizer": null, "trainable": true, "epsilon": 1e-05, "axis": 3}}, {"class_name": "Convolution2D", "inbound_nodes": [[["mixed5", 0, 0]]], "name": "convolution2d_334", "config": {"trainable": true, "b_regularizer": null, "name": "convolution2d_334", "init": "glorot_uniform", "b_constraint": null, "subsample": [1, 1], "border_mode": "same", "nb_filter": 160, "W_regularizer": null, "W_constraint": null, "activity_regularizer": null, "activation": "relu", "dim_ordering": "tf", "nb_row": 1, "bias": true, "nb_col": 1}}, {"class_name": "Convolution2D", "inbound_nodes": [[["batchnormalization_340", 0, 0]]], "name": "convolution2d_339", "config": {"trainable": true, "b_regularizer": null, "name": "convolution2d_339", "init": "glorot_uniform", "b_constraint": null, "subsample": [1, 1], "border_mode": "same", "nb_filter": 160, "W_regularizer": null, "W_constraint": null, "activity_regularizer": null, "activation": "relu", "dim_ordering": "tf", "nb_row": 1, "bias": true, "nb_col": 7}}, {"class_name": "BatchNormalization", "inbound_nodes": [[["convolution2d_334", 0, 0]]], "name": "batchnormalization_336", "config": {"mode": 0, "gamma_regularizer": null, "momentum": 0.99, "name": "batchnormalization_336", "beta_regularizer": null, "trainable": true, "epsilon": 1e-05, "axis": 3}}, {"class_name": "BatchNormalization", "inbound_nodes": [[["convolution2d_339", 0, 0]]], "name": "batchnormalization_341", "config": {"mode": 0, "gamma_regularizer": null, "momentum": 0.99, "name": "batchnormalization_341", "beta_regularizer": null, "trainable": true, "epsilon": 1e-05, "axis": 3}}, {"class_name": "Convolution2D", "inbound_nodes": [[["batchnormalization_336", 0, 0]]], "name": "convolution2d_335", "config": {"trainable": true, "b_regularizer": null, "name": "convolution2d_335", "init": "glorot_uniform", "b_constraint": null, "subsample": [1, 1], "border_mode": "same", "nb_filter": 160, "W_regularizer": null, "W_constraint": null, "activity_regularizer": null, "activation": "relu", "dim_ordering": "tf", "nb_row": 1, "bias": true, "nb_col": 7}}, {"class_name": "Convolution2D", "inbound_nodes": [[["batchnormalization_341", 0, 0]]], "name": "convolution2d_340", "config": {"trainable": true, "b_regularizer": null, "name": "convolution2d_340", "init": "glorot_uniform", "b_constraint": null, "subsample": [1, 1], "border_mode": "same", "nb_filter": 160, "W_regularizer": null, "W_constraint": null, "activity_regularizer": null, "activation": "relu", "dim_ordering": "tf", "nb_row": 7, "bias": true, "nb_col": 1}}, {"class_name": "BatchNormalization", "inbound_nodes": [[["convolution2d_335", 0, 0]]], "name": "batchnormalization_337", "config": {"mode": 0, "gamma_regularizer": null, "momentum": 0.99, "name": "batchnormalization_337", "beta_regularizer": null, "trainable": true, "epsilon": 1e-05, "axis": 3}}, {"class_name": "BatchNormalization", "inbound_nodes": [[["convolution2d_340", 0, 0]]], "name": "batchnormalization_342", "config": {"mode": 0, "gamma_regularizer": null, "momentum": 0.99, "name": "batchnormalization_342", "beta_regularizer": null, "trainable": true, "epsilon": 1e-05, "axis": 3}}, {"class_name": "AveragePooling2D", "inbound_nodes": [[["mixed5", 0, 0]]], "name": "averagepooling2d_36", "config": {"pool_size": [3, 3], "trainable": true, "name": "averagepooling2d_36", "border_mode": "same", "strides": [1, 1], "dim_ordering": "tf"}}, {"class_name": "Convolution2D", "inbound_nodes": [[["mixed5", 0, 0]]], "name": "convolution2d_333", "config": {"trainable": true, "b_regularizer": null, "name": "convolution2d_333", "init": "glorot_uniform", "b_constraint": null, "subsample": [1, 1], "border_mode": "same", "nb_filter": 192, "W_regularizer": null, "W_constraint": null, "activity_regularizer": null, "activation": "relu", "dim_ordering": "tf", "nb_row": 1, "bias": true, "nb_col": 1}}, {"class_name": "Convolution2D", "inbound_nodes": [[["batchnormalization_337", 0, 0]]], "name": "convolution2d_336", "config": {"trainable": true, "b_regularizer": null, "name": "convolution2d_336", "init": "glorot_uniform", "b_constraint": null, "subsample": [1, 1], "border_mode": "same", "nb_filter": 192, "W_regularizer": null, "W_constraint": null, "activity_regularizer": null, "activation": "relu", "dim_ordering": "tf", "nb_row": 7, "bias": true, "nb_col": 1}}, {"class_name": "Convolution2D", "inbound_nodes": [[["batchnormalization_342", 0, 0]]], "name": "convolution2d_341", "config": {"trainable": true, "b_regularizer": null, "name": "convolution2d_341", "init": "glorot_uniform", "b_constraint": null, "subsample": [1, 1], "border_mode": "same", "nb_filter": 192, "W_regularizer": null, "W_constraint": null, "activity_regularizer": null, "activation": "relu", "dim_ordering": "tf", "nb_row": 1, "bias": true, "nb_col": 7}}, {"class_name": "Convolution2D", "inbound_nodes": [[["averagepooling2d_36", 0, 0]]], "name": "convolution2d_342", "config": {"trainable": true, "b_regularizer": null, "name": "convolution2d_342", "init": "glorot_uniform", "b_constraint": null, "subsample": [1, 1], "border_mode": "same", "nb_filter": 192, "W_regularizer": null, "W_constraint": null, "activity_regularizer": null, "activation": "relu", "dim_ordering": "tf", "nb_row": 1, "bias": true, "nb_col": 1}}, {"class_name": "BatchNormalization", "inbound_nodes": [[["convolution2d_333", 0, 0]]], "name": "batchnormalization_335", "config": {"mode": 0, "gamma_regularizer": null, "momentum": 0.99, "name": "batchnormalization_335", "beta_regularizer": null, "trainable": true, "epsilon": 1e-05, "axis": 3}}, {"class_name": "BatchNormalization", "inbound_nodes": [[["convolution2d_336", 0, 0]]], "name": "batchnormalization_338", "config": {"mode": 0, 