{"keras_version": "1.1.1", "config": [{"config": {"border_mode": "same", "input_dtype": "float32", "name": "convolution2d_10", "batch_input_shape": [null, 160, 320, 3], "trainable": true, "b_regularizer": null, "b_constraint": null, "W_constraint": null, "activation": "linear", "bias": true, "subsample": [2, 2], "activity_regularizer": null, "W_regularizer": null, "init": "glorot_uniform", "nb_row": 5, "dim_ordering": "tf", "nb_filter": 24, "nb_col": 5}, "class_name": "Convolution2D"}, {"config": {"trainable": true, "name": "Conv1", "activation": "relu"}, "class_name": "Activation"}, {"config": {"border_mode": "valid", "nb_row": 5, "name": "convolution2d_11", "activity_regularizer": null, "b_regularizer": null, "b_constraint": null, "W_constraint": null, "activation": "linear", "subsample": [2, 2], "bias": true, "W_regularizer": null, "init": "glorot_uniform", "trainable": true, "dim_ordering": "tf", "nb_filter": 36, "nb_col": 5}, "class_name": "Convolution2D"}, {"config": {"trainable": true, "name": "Conv2", "activation": "relu"}, "class_name": "Activation"}, {"config": {"border_mode": "valid", "pool_size": [2, 2], "dim_ordering": "tf", "strides": [2, 2], "trainable": true, "name": "maxpooling2d_7"}, "class_name": "MaxPooling2D"}, {"config": {"p": 0.5, "name": "dropout_7", "trainable": true}, "class_name": "Dropout"}, {"config": {"border_mode": "valid", "nb_row": 5, "name": "convolution2d_12", "activity_regularizer": null, "b_regularizer": null, "b_constraint": null, "W_constraint": null, "activation": "linear", "subsample": [1, 1], "bias": true, "W_regularizer": null, "init": "glorot_uniform", "trainable": true, "dim_ordering": "tf", "nb_filter": 48, "nb_col": 5}, "class_name": "Convolution2D"}, {"config": {"trainable": true, "name": "Conv3", "activation": "relu"}, "class_name": "Activation"}, {"config": {"border_mode": "valid", "nb_row": 3, "name": "convolution2d_13", "activity_regularizer": null, "b_regularizer": null, "b_constraint": null, "W_constraint": null, "activation": "linear", "subsample": [1, 1], "bias": true, "W_regularizer": null, "init": "glorot_uniform", "trainable": true, "dim_ordering": "tf", "nb_filter": 64, "nb_col": 3}, "class_name": "Convolution2D"}, {"config": {"name": "batchnormalization_7", "mode": 0, "epsilon": 1e-05, "axis": -1, "beta_regularizer": null, "trainable": true, "momentum": 0.99, "gamma_regularizer": null}, "class_name": "BatchNormalization"}, {"config": {"trainable": true, "name": "Conv4", "activation": "relu"}, "class_name": "Activation"}, {"config": {"border_mode": "valid", "nb_row": 3, "name": "convolution2d_14", "activity_regularizer": null, "b_regularizer": null, "b_constraint": null, "W_constraint": null, "activation": "linear", "subsample": [1, 1], "bias": true, "W_regularizer": null, "init": "glorot_uniform", "trainable": true, "dim_ordering": "tf", "nb_filter": 64, "nb_col": 3}, "class_name": "Convolution2D"}, {"config": {"trainable": true, "name": "Conv5", "activation": "relu"}, "class_name": "Activation"}, {"config": {"border_mode": "valid", "pool_size": [2, 2], "dim_ordering": "tf", "strides": [2, 2], "trainable": true, "name": "maxpooling2d_8"}, "class_name": "MaxPooling2D"}, {"config": {"p": 0.5, "name": "dropout_8", "trainable": true}, "class_name": "Dropout"}, {"config": {"name": "flatten_4", "trainable": true}, "class_name": "Flatten"}, {"config": {"W_regularizer": null, "name": "dense_13", "activity_regularizer": null, "b_regularizer": null, "activation": "linear", "W_constraint": null, "b_constraint": null, "bias": true, "input_dim": null, "init": "glorot_uniform", "output_dim": 1164, "trainable": true}, "class_name": "Dense"}, {"config": {"trainable": true, "name": "FC1", "activation": "relu"}, "class_name": "Activation"}, {"config": {"W_regularizer": null, "name": "dense_14", "activity_regularizer": null, "b_regularizer": null, "activation": "linear", "W_constraint": null, "b_constraint": null, "bias": true, "input_dim": null, "init": "glorot_uniform", "output_dim": 100, "trainable": true}, "class_name": "Dense"}, {"config": {"trainable": true, "name": "FC2", "activation": "relu"}, "class_name": "Activation"}, {"config": {"W_regularizer": null, "name": "dense_15", "activity_regularizer": null, "b_regularizer": null, "activation": "linear", "W_constraint": null, "b_constraint": null, "bias": true, "input_dim": null, "init": "glorot_uniform", "output_dim": 50, "trainable": true}, "class_name": "Dense"}, {"config": {"trainable": true, "name": "FC3", "activation": "relu"}, "class_name": "Activation"}, {"config": {"W_regularizer": null, "name": "dense_16", "activity_regularizer": null, "b_regularizer": null, "activation": "linear", "W_constraint": null, "b_constraint": null, "bias": true, "input_dim": null, "init": "glorot_uniform", "output_dim": 10, "trainable": true}, "class_name": "Dense"}, {"config": {"name": "batchnormalization_8", "mode": 0, "epsilon": 1e-05, "axis": -1, "beta_regularizer": null, "trainable": true, "momentum": 0.99, "gamma_regularizer": null}, "class_name": "BatchNormalization"}, {"config": {"trainable": true, "name": "FC4", "activation": "relu"}, "class_name": "Activation"}, {"config": {"W_regularizer": null, "name": "output", "activity_regularizer": null, "b_regularizer": null, "activation": "relu", "W_constraint": null, "b_constraint": null, "bias": true, "input_dim": null, "init": "glorot_uniform", "output_dim": 1, "trainable": true}, "class_name": "Dense"}], "class_name": "Sequential"}