{"class_name": "Sequential", "keras_version": "1.1.2", "config": [{"class_name": "Cropping2D", "config": {"input_dtype": "float32", "cropping": [[60, 20], [39, 39]], "trainable": true, "batch_input_shape": [null, 160, 320, 3], "name": "cropping2d_7"}}, {"class_name": "Lambda", "config": {"function": ["\u00e3\u0001\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0001\u0000\u0000\u0000\u0003\u0000\u0000\u0000C\u0000\u0000\u0000s\r\u0000\u0000\u0000t\u0000\u0000|\u0000\u0000t\u0001\u0000\u0083\u0002\u0000S)\u0001N)\u0002\u00da\ttf_resize\u00da\tnew_shape)\u0001\u00da\u0001x\u00a9\u0000r\u0004\u0000\u0000\u0000\u00fa\u001f<ipython-input-16-9a6afc80d6d0>\u00da\b<lambda>\t\u0000\u0000\u0000s\u0000\u0000\u0000\u0000", null, null], "name": "lambda_8", "output_shape_type": "raw", "output_shape": null, "function_type": "lambda", "trainable": true, "arguments": {}}}, {"class_name": "Lambda", "config": {"function": ["\u00e3\u0001\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0001\u0000\u0000\u0000\u0002\u0000\u0000\u0000C\u0000\u0000\u0000s\f\u0000\u0000\u0000|\u0000\u0000d\u0001\u0000\u001bd\u0002\u0000\u0018S)\u0003Ng\u0000\u0000\u0000\u0000\u0000\u00e0_@g\u0000\u0000\u0000\u0000\u0000\u0000\u00f0?\u00a9\u0000)\u0001\u00da\u0001xr\u0001\u0000\u0000\u0000r\u0001\u0000\u0000\u0000\u00fa\u001f<ipython-input-16-9a6afc80d6d0>\u00da\b<lambda>\n\u0000\u0000\u0000s\u0000\u0000\u0000\u0000", null, null], "name": "lambda_9", "output_shape_type": "raw", "output_shape": null, "function_type": "lambda", "trainable": true, "arguments": {}}}, {"class_name": "Convolution2D", "config": {"init": "glorot_uniform", "b_constraint": null, "W_regularizer": null, "activation": "relu", "activity_regularizer": null, "nb_row": 5, "b_regularizer": null, "border_mode": "valid", "name": "Conv1", "trainable": true, "nb_col": 5, "nb_filter": 24, "bias": true, "W_constraint": null, "dim_ordering": "tf", "subsample": [2, 2]}}, {"class_name": "Convolution2D", "config": {"init": "glorot_uniform", "b_constraint": null, "W_regularizer": null, "activation": "relu", "activity_regularizer": null, "nb_row": 5, "b_regularizer": null, "border_mode": "valid", "name": "Conv2", "trainable": true, "nb_col": 5, "nb_filter": 36, "bias": true, "W_constraint": null, "dim_ordering": "tf", "subsample": [2, 2]}}, {"class_name": "Convolution2D", "config": {"init": "glorot_uniform", "b_constraint": null, "W_regularizer": null, "activation": "relu", "activity_regularizer": null, "nb_row": 5, "b_regularizer": null, "border_mode": "valid", "name": "Conv3", "trainable": true, "nb_col": 5, "nb_filter": 48, "bias": true, "W_constraint": null, "dim_ordering": "tf", "subsample": [2, 2]}}, {"class_name": "Convolution2D", "config": {"init": "glorot_uniform", "b_constraint": null, "W_regularizer": null, "activation": "relu", "activity_regularizer": null, "nb_row": 3, "b_regularizer": null, "border_mode": "valid", "name": "Conv4", "trainable": true, "nb_col": 3, "nb_filter": 64, "bias": true, "W_constraint": null, "dim_ordering": "tf", "subsample": [1, 1]}}, {"class_name": "Convolution2D", "config": {"init": "glorot_uniform", "b_constraint": null, "W_regularizer": null, "activation": "relu", "activity_regularizer": null, "nb_row": 3, "b_regularizer": null, "border_mode": "valid", "name": "Conv5", "trainable": true, "nb_col": 3, "nb_filter": 64, "bias": true, "W_constraint": null, "dim_ordering": "tf", "subsample": [1, 1]}}, {"class_name": "Flatten", "config": {"name": "flatten_2", "trainable": true}}, {"class_name": "Dense", "config": {"init": "glorot_uniform", "b_constraint": null, "W_regularizer": null, "activation": "relu", "input_dim": null, "activity_regularizer": null, "output_dim": 1164, "b_regularizer": null, "name": "FC1", "trainable": true, "bias": true, "W_constraint": null}}, {"class_name": "Dense", "config": {"init": "glorot_uniform", "b_constraint": null, "W_regularizer": null, "activation": "relu", "input_dim": null, "activity_regularizer": null, "output_dim": 100, "b_regularizer": null, "name": "FC2", "trainable": true, "bias": true, "W_constraint": null}}, {"class_name": "Dense", "config": {"init": "glorot_uniform", "b_constraint": null, "W_regularizer": null, "activation": "relu", "input_dim": null, "activity_regularizer": null, "output_dim": 50, "b_regularizer": null, "name": "FC3", "trainable": true, "bias": true, "W_constraint": null}}, {"class_name": "Dense", "config": {"init": "glorot_uniform", "b_constraint": null, "W_regularizer": null, "activation": "relu", "input_dim": null, "activity_regularizer": null, "output_dim": 10, "b_regularizer": null, "name": "FC4", "trainable": true, "bias": true, "W_constraint": null}}, {"class_name": "Dense", "config": {"init": "glorot_uniform", "b_constraint": null, "W_regularizer": null, "activation": "linear", "input_dim": null, "activity_regularizer": null, "output_dim": 1, "b_regularizer": null, "name": "output", "trainable": true, "bias": true, "W_constraint": null}}]}