{"class_name": "Sequential", "config": [{"class_name": "Convolution2D", "config": {"W_constraint": null, "b_constraint": null, "activity_regularizer": null, "batch_input_shape": [null, 160, 320, 3], "nb_col": 5, "nb_row": 5, "dim_ordering": "tf", "name": "convolution2d_17", "subsample": [2, 2], "W_regularizer": null, "trainable": true, "nb_filter": 24, "bias": true, "border_mode": "same", "b_regularizer": null, "activation": "linear", "init": "glorot_uniform", "input_dtype": "float32"}}, {"class_name": "Activation", "config": {"name": "Conv1", "trainable": true, "activation": "relu"}}, {"class_name": "Convolution2D", "config": {"W_constraint": null, "b_constraint": null, "activity_regularizer": null, "nb_col": 5, "nb_row": 5, "name": "convolution2d_18", "subsample": [2, 2], "W_regularizer": null, "trainable": true, "nb_filter": 36, "bias": true, "border_mode": "valid", "b_regularizer": null, "activation": "linear", "init": "glorot_uniform", "dim_ordering": "tf"}}, {"class_name": "Activation", "config": {"name": "Conv2", "trainable": true, "activation": "relu"}}, {"class_name": "MaxPooling2D", "config": {"name": "maxpooling2d_11", "trainable": true, "pool_size": [2, 2], "dim_ordering": "tf", "border_mode": "valid", "strides": [2, 2]}}, {"class_name": "Dropout", "config": {"name": "dropout_12", "trainable": true, "p": 0.5}}, {"class_name": "Convolution2D", "config": {"W_constraint": null, "b_constraint": null, "activity_regularizer": null, "nb_col": 5, "nb_row": 5, "name": "convolution2d_19", "subsample": [1, 1], "W_regularizer": null, "trainable": true, "nb_filter": 48, "bias": true, "border_mode": "valid", "b_regularizer": null, "activation": "linear", "init": "glorot_uniform", "dim_ordering": "tf"}}, {"class_name": "Activation", "config": {"name": "Conv3", "trainable": true, "activation": "relu"}}, {"class_name": "Convolution2D", "config": {"W_constraint": null, "b_constraint": null, "activity_regularizer": null, "nb_col": 3, "nb_row": 3, "name": "convolution2d_20", "subsample": [1, 1], "W_regularizer": null, "trainable": true, "nb_filter": 64, "bias": true, "border_mode": "valid", "b_regularizer": null, "activation": "linear", "init": "glorot_uniform", "dim_ordering": "tf"}}, {"class_name": "Activation", "config": {"name": "Conv5", "trainable": true, "activation": "relu"}}, {"class_name": "MaxPooling2D", "config": {"name": "maxpooling2d_12", "trainable": true, "pool_size": [2, 2], "dim_ordering": "tf", "border_mode": "valid", "strides": [2, 2]}}, {"class_name": "Dropout", "config": {"name": "dropout_13", "trainable": true, "p": 0.5}}, {"class_name": "Flatten", "config": {"name": "flatten_4", "trainable": true}}, {"class_name": "Dense", "config": {"W_constraint": null, "b_regularizer": null, "input_dim": null, "W_regularizer": null, "activity_regularizer": null, "name": "dense_13", "trainable": true, "output_dim": 1164, "bias": true, "b_constraint": null, "activation": "linear", "init": "glorot_uniform"}}, {"class_name": "Activation", "config": {"name": "FC1", "trainable": true, "activation": "relu"}}, {"class_name": "Dense", "config": {"W_constraint": null, "b_regularizer": null, "input_dim": null, "W_regularizer": null, "activity_regularizer": null, "name": "dense_14", "trainable": true, "output_dim": 100, "bias": true, "b_constraint": null, "activation": "linear", "init": "glorot_uniform"}}, {"class_name": "Activation", "config": {"name": "FC2", "trainable": true, "activation": "relu"}}, {"class_name": "Dense", "config": {"W_constraint": null, "b_regularizer": null, "input_dim": null, "W_regularizer": null, "activity_regularizer": null, "name": "dense_15", "trainable": true, "output_dim": 50, "bias": true, "b_constraint": null, "activation": "linear", "init": "glorot_uniform"}}, {"class_name": "Activation", "config": {"name": "FC3", "trainable": true, "activation": "relu"}}, {"class_name": "Dense", "config": {"W_constraint": null, "b_regularizer": null, "input_dim": null, "W_regularizer": null, "activity_regularizer": null, "name": "dense_16", "trainable": true, "output_dim": 10, "bias": true, "b_constraint": null, "activation": "linear", "init": "glorot_uniform"}}, {"class_name": "BatchNormalization", "config": {"epsilon": 1e-05, "name": "batchnormalization_4", "trainable": true, "axis": -1, "mode": 0, "momentum": 0.99, "gamma_regularizer": null, "beta_regularizer": null}}, {"class_name": "Activation", "config": {"name": "FC4", "trainable": true, "activation": "relu"}}, {"class_name": "Dense", "config": {"W_constraint": null, "b_regularizer": null, "input_dim": null, "W_regularizer": null, "activity_regularizer": null, "name": "output", "trainable": true, "output_dim": 1, "bias": true, "b_constraint": null, "activation": "linear", "init": "glorot_uniform"}}], "keras_version": "1.1.1"}