{"keras_version": "1.1.1", "config": [{"config": {"name": "convolution2d_31", "W_constraint": null, "activation": "linear", "input_dtype": "float32", "trainable": true, "b_constraint": null, "activity_regularizer": null, "nb_filter": 16, "nb_row": 5, "subsample": [2, 2], "init": "glorot_uniform", "batch_input_shape": [null, 100, 320, 3], "border_mode": "valid", "b_regularizer": null, "nb_col": 5, "bias": true, "W_regularizer": null, "dim_ordering": "tf"}, "class_name": "Convolution2D"}, {"config": {"name": "batchnormalization_38", "epsilon": 1e-05, "beta_regularizer": null, "mode": 0, "momentum": 0.99, "axis": -1, "trainable": true, "gamma_regularizer": null}, "class_name": "BatchNormalization"}, {"config": {"trainable": true, "name": "activation_20", "activation": "relu"}, "class_name": "Activation"}, {"config": {"name": "maxpooling2d_14", "pool_size": [2, 2], "border_mode": "valid", "trainable": true, "dim_ordering": "tf", "strides": [2, 2]}, "class_name": "MaxPooling2D"}, {"config": {"W_constraint": null, "activation": "linear", "nb_filter": 32, "b_constraint": null, "activity_regularizer": null, "trainable": true, "nb_row": 5, "subsample": [1, 1], "init": "glorot_uniform", "name": "convolution2d_32", "border_mode": "valid", "b_regularizer": null, "nb_col": 5, "bias": true, "W_regularizer": null, "dim_ordering": "tf"}, "class_name": "Convolution2D"}, {"config": {"name": "batchnormalization_39", "epsilon": 1e-05, "beta_regularizer": null, "mode": 0, "momentum": 0.99, "axis": -1, "trainable": true, "gamma_regularizer": null}, "class_name": "BatchNormalization"}, {"config": {"trainable": true, "name": "activation_21", "activation": "relu"}, "class_name": "Activation"}, {"config": {"name": "maxpooling2d_15", "pool_size": [2, 2], "border_mode": "valid", "trainable": true, "dim_ordering": "tf", "strides": [2, 2]}, "class_name": "MaxPooling2D"}, {"config": {"trainable": true, "name": "dropout_4", "p": 0.5}, "class_name": "Dropout"}, {"config": {"W_constraint": null, "activation": "linear", "nb_filter": 128, "b_constraint": null, "activity_regularizer": null, "trainable": true, "nb_row": 3, "subsample": [1, 1], "init": "glorot_uniform", "name": "convolution2d_33", "border_mode": "valid", "b_regularizer": null, "nb_col": 3, "bias": true, "W_regularizer": null, "dim_ordering": "tf"}, "class_name": "Convolution2D"}, {"config": {"name": "batchnormalization_40", "epsilon": 1e-05, "beta_regularizer": null, "mode": 0, "momentum": 0.99, "axis": -1, "trainable": true, "gamma_regularizer": null}, "class_name": "BatchNormalization"}, {"config": {"trainable": true, "name": "activation_22", "activation": "relu"}, "class_name": "Activation"}, {"config": {"name": "maxpooling2d_16", "pool_size": [2, 2], "border_mode": "valid", "trainable": true, "dim_ordering": "tf", "strides": [2, 2]}, "class_name": "MaxPooling2D"}, {"config": {"name": "flatten_5", "trainable": true}, "class_name": "Flatten"}, {"config": {"activity_regularizer": null, "activation": "linear", "output_dim": 256, "b_constraint": null, "W_constraint": null, "trainable": true, "init": "glorot_uniform", "name": "dense_13", "b_regularizer": null, "bias": true, "W_regularizer": null, "input_dim": null}, "class_name": "Dense"}, {"config": {"name": "batchnormalization_41", "epsilon": 1e-05, "beta_regularizer": null, "mode": 0, "momentum": 0.99, "axis": -1, "trainable": true, "gamma_regularizer": null}, "class_name": "BatchNormalization"}, {"config": {"trainable": true, "name": "activation_23", "activation": "relu"}, "class_name": "Activation"}, {"config": {"activity_regularizer": null, "activation": "linear", "output_dim": 1024, "b_constraint": null, "W_constraint": null, "trainable": true, "init": "glorot_uniform", "name": "dense_14", "b_regularizer": null, "bias": true, "W_regularizer": null, "input_dim": null}, "class_name": "Dense"}, {"config": {"name": "batchnormalization_42", "epsilon": 1e-05, "beta_regularizer": null, "mode": 0, "momentum": 0.99, "axis": -1, "trainable": true, "gamma_regularizer": null}, "class_name": "BatchNormalization"}, {"config": {"trainable": true, "name": "activation_24", "activation": "relu"}, "class_name": "Activation"}, {"config": {"activity_regularizer": null, "activation": "linear", "output_dim": 1, "b_constraint": null, "W_constraint": null, "trainable": true, "init": "glorot_uniform", "name": "dense_15", "b_regularizer": null, "bias": true, "W_regularizer": null, "input_dim": null}, "class_name": "Dense"}], "class_name": "Sequential"}