{"keras_version": "1.1.1", "class_name": "Sequential", "config": [{"class_name": "Convolution2D", "config": {"b_constraint": null, "border_mode": "valid", "bias": true, "input_dtype": "float32", "nb_row": 5, "activity_regularizer": null, "init": "glorot_uniform", "dim_ordering": "tf", "trainable": true, "batch_input_shape": [null, 160, 320, 3], "activation": "linear", "name": "convolution2d_1", "W_regularizer": null, "W_constraint": null, "nb_col": 5, "subsample": [2, 2], "nb_filter": 24, "b_regularizer": null}}, {"class_name": "BatchNormalization", "config": {"epsilon": 1e-05, "name": "batchnormalization_1", "momentum": 0.99, "gamma_regularizer": null, "mode": 0, "axis": -1, "trainable": true, "beta_regularizer": null}}, {"class_name": "Activation", "config": {"name": "activation_1", "trainable": true, "activation": "relu"}}, {"class_name": "Convolution2D", "config": {"b_constraint": null, "border_mode": "valid", "dim_ordering": "tf", "bias": true, "b_regularizer": null, "name": "convolution2d_2", "activity_regularizer": null, "init": "glorot_uniform", "nb_row": 5, "trainable": true, "activation": "linear", "W_regularizer": null, "W_constraint": null, "nb_col": 5, "subsample": [2, 2], "nb_filter": 36}}, {"class_name": "BatchNormalization", "config": {"epsilon": 1e-05, "name": "batchnormalization_2", "momentum": 0.99, "gamma_regularizer": null, "mode": 0, "axis": -1, "trainable": true, "beta_regularizer": null}}, {"class_name": "Activation", "config": {"name": "activation_2", "trainable": true, "activation": "relu"}}, {"class_name": "Convolution2D", "config": {"b_constraint": null, "border_mode": "valid", "dim_ordering": "tf", "bias": true, "b_regularizer": null, "name": "convolution2d_3", "activity_regularizer": null, "init": "glorot_uniform", "nb_row": 5, "trainable": true, "activation": "linear", "W_regularizer": null, "W_constraint": null, "nb_col": 5, "subsample": [2, 2], "nb_filter": 48}}, {"class_name": "BatchNormalization", "config": {"epsilon": 1e-05, "name": "batchnormalization_3", "momentum": 0.99, "gamma_regularizer": null, "mode": 0, "axis": -1, "trainable": true, "beta_regularizer": null}}, {"class_name": "Activation", "config": {"name": "activation_3", "trainable": true, "activation": "relu"}}, {"class_name": "Convolution2D", "config": {"b_constraint": null, "border_mode": "valid", "dim_ordering": "tf", "bias": true, "b_regularizer": null, "name": "convolution2d_4", "activity_regularizer": null, "init": "glorot_uniform", "nb_row": 3, "trainable": true, "activation": "linear", "W_regularizer": null, "W_constraint": null, "nb_col": 3, "subsample": [1, 1], "nb_filter": 64}}, {"class_name": "BatchNormalization", "config": {"epsilon": 1e-05, "name": "batchnormalization_4", "momentum": 0.99, "gamma_regularizer": null, "mode": 0, "axis": -1, "trainable": true, "beta_regularizer": null}}, {"class_name": "Activation", "config": {"name": "activation_4", "trainable": true, "activation": "relu"}}, {"class_name": "Convolution2D", "config": {"b_constraint": null, "border_mode": "valid", "dim_ordering": "tf", "bias": true, "b_regularizer": null, "name": "convolution2d_5", "activity_regularizer": null, "init": "glorot_uniform", "nb_row": 3, "trainable": true, "activation": "linear", "W_regularizer": null, "W_constraint": null, "nb_col": 3, "subsample": [1, 1], "nb_filter": 64}}, {"class_name": "BatchNormalization", "config": {"epsilon": 1e-05, "name": "batchnormalization_5", "momentum": 0.99, "gamma_regularizer": null, "mode": 0, "axis": -1, "trainable": true, "beta_regularizer": null}}, {"class_name": "Activation", "config": {"name": "activation_5", "trainable": true, "activation": "relu"}}, {"class_name": "Flatten", "config": {"name": "flatten_1", "trainable": true}}, {"class_name": "Dense", "config": {"b_constraint": null, "bias": true, "b_regularizer": null, "name": "dense_1", "output_dim": 1154, "init": "glorot_uniform", "activity_regularizer": null, "trainable": true, "input_dim": null, "activation": "linear", "W_regularizer": null, "W_constraint": null}}, {"class_name": "BatchNormalization", "config": {"epsilon": 1e-05, "name": "batchnormalization_6", "momentum": 0.99, "gamma_regularizer": null, "mode": 0, "axis": -1, "trainable": true, "beta_regularizer": null}}, {"class_name": "Activation", "config": {"name": "activation_6", "trainable": true, "activation": "relu"}}, {"class_name": "Dense", "config": {"b_constraint": null, "bias": true, "b_regularizer": null, "name": "dense_2", "output_dim": 100, "init": "glorot_uniform", "activity_regularizer": null, "trainable": true, "input_dim": null, "activation": "linear", "W_regularizer": null, "W_constraint": null}}, {"class_name": "BatchNormalization", "config": {"epsilon": 1e-05, "name": "batchnormalization_7", "momentum": 0.99, "gamma_regularizer": null, "mode": 0, "axis": -1, "trainable": true, "beta_regularizer": null}}, {"class_name": "Activation", "config": {"name": "activation_7", "trainable": true, "activation": "relu"}}, {"class_name": "Dense", "config": {"b_constraint": null, "bias": true, "b_regularizer": null, "name": "dense_3", "output_dim": 50, "init": "glorot_uniform", "activity_regularizer": null, "trainable": true, "input_dim": null, "activation": "linear", "W_regularizer": null, "W_constraint": null}}, {"class_name": "BatchNormalization", "config": {"epsilon": 1e-05, "name": "batchnormalization_8", "momentum": 0.99, "gamma_regularizer": null, "mode": 0, "axis": -1, "trainable": true, "beta_regularizer": null}}, {"class_name": "Activation", "config": {"name": "activation_8", "trainable": true, "activation": "relu"}}, {"class_name": "Dense", "config": {"b_constraint": null, "bias": true, "b_regularizer": null, "name": "dense_4", "output_dim": 10, "init": "glorot_uniform", "activity_regularizer": null, "trainable": true, "input_dim": null, "activation": "linear", "W_regularizer": null, "W_constraint": null}}, {"class_name": "BatchNormalization", "config": {"epsilon": 1e-05, "name": "batchnormalization_9", "momentum": 0.99, "gamma_regularizer": null, "mode": 0, "axis": -1, "trainable": true, "beta_regularizer": null}}, {"class_name": "Activation", "config": {"name": "activation_9", "trainable": true, "activation": "relu"}}, {"class_name": "Dense", "config": {"b_constraint": null, "bias": true, "b_regularizer": null, "name": "dense_5", "output_dim": 1, "init": "glorot_uniform", "activity_regularizer": null, "trainable": true, "input_dim": null, "activation": "linear", "W_regularizer": null, "W_constraint": null}}]}