{"keras_version": "1.1.2", "class_name": "Sequential", "config": [{"class_name": "Lambda", "config": {"input_dtype": "float32", "function": ["\u00e3\u0001\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0001\u0000\u0000\u0000\u0002\u0000\u0000\u0000C\u0000\u0000\u0000s\f\u0000\u0000\u0000|\u0000\u0000d\u0001\u0000\u001bd\u0002\u0000\u0018S)\u0003Ng\u0000\u0000\u0000\u0000\u0000\u00e0_@g\u0000\u0000\u0000\u0000\u0000\u0000\u00f0?\u00a9\u0000)\u0001\u00da\u0001xr\u0001\u0000\u0000\u0000r\u0001\u0000\u0000\u0000\u00fa\u001e<ipython-input-9-0cd63baa9943>\u00da\b<lambda>\u0002\u0000\u0000\u0000s\u0000\u0000\u0000\u0000", null, null], "output_shape": null, "output_shape_type": "raw", "name": "Normalization", "function_type": "lambda", "arguments": {}, "trainable": true, "batch_input_shape": [null, 66, 200, 3]}}, {"class_name": "Convolution2D", "config": {"nb_filter": 24, "name": "Conv1", "dim_ordering": "tf", "trainable": true, "b_constraint": null, "b_regularizer": null, "border_mode": "valid", "bias": true, "nb_col": 5, "W_constraint": null, "nb_row": 5, "init": "glorot_uniform", "activation": "relu", "W_regularizer": null, "activity_regularizer": null, "subsample": [2, 2]}}, {"class_name": "Convolution2D", "config": {"nb_filter": 36, "name": "Conv2", "dim_ordering": "tf", "trainable": true, "b_constraint": null, "b_regularizer": null, "border_mode": "valid", "bias": true, "nb_col": 5, "W_constraint": null, "nb_row": 5, "init": "glorot_uniform", "activation": "relu", "W_regularizer": null, "activity_regularizer": null, "subsample": [2, 2]}}, {"class_name": "Convolution2D", "config": {"nb_filter": 48, "name": "Conv3", "dim_ordering": "tf", "trainable": true, "b_constraint": null, "b_regularizer": null, "border_mode": "valid", "bias": true, "nb_col": 5, "W_constraint": null, "nb_row": 5, "init": "glorot_uniform", "activation": "relu", "W_regularizer": null, "activity_regularizer": null, "subsample": [2, 2]}}, {"class_name": "SpatialDropout2D", "config": {"trainable": true, "p": 0.5, "name": "spatialdropout2d_1"}}, {"class_name": "Convolution2D", "config": {"nb_filter": 64, "name": "Conv4", "dim_ordering": "tf", "trainable": true, "b_constraint": null, "b_regularizer": null, "border_mode": "valid", "bias": true, "nb_col": 3, "W_constraint": null, "nb_row": 3, "init": "glorot_uniform", "activation": "relu", "W_regularizer": null, "activity_regularizer": null, "subsample": [1, 1]}}, {"class_name": "Convolution2D", "config": {"nb_filter": 64, "name": "Conv5", "dim_ordering": "tf", "trainable": true, "b_constraint": null, "b_regularizer": null, "border_mode": "valid", "bias": true, "nb_col": 3, "W_constraint": null, "nb_row": 3, "init": "glorot_uniform", "activation": "relu", "W_regularizer": null, "activity_regularizer": null, "subsample": [1, 1]}}, {"class_name": "Flatten", "config": {"trainable": true, "name": "flatten_1"}}, {"class_name": "Dense", "config": {"name": "FC1", "trainable": true, "b_constraint": null, "input_dim": null, "activity_regularizer": null, "output_dim": 1164, "bias": true, "W_constraint": null, "init": "glorot_uniform", "activation": "relu", "W_regularizer": null, "b_regularizer": null}}, {"class_name": "Dense", "config": {"name": "FC2", "trainable": true, "b_constraint": null, "input_dim": null, "activity_regularizer": null, "output_dim": 100, "bias": true, "W_constraint": null, "init": "glorot_uniform", "activation": "relu", "W_regularizer": null, "b_regularizer": null}}, {"class_name": "Dense", "config": {"name": "FC3", "trainable": true, "b_constraint": null, "input_dim": null, "activity_regularizer": null, "output_dim": 50, "bias": true, "W_constraint": null, "init": "glorot_uniform", "activation": "relu", "W_regularizer": null, "b_regularizer": null}}, {"class_name": "Dense", "config": {"name": "FC4", "trainable": true, "b_constraint": null, "input_dim": null, "activity_regularizer": null, "output_dim": 10, "bias": true, "W_constraint": null, "init": "glorot_uniform", "activation": "relu", "W_regularizer": null, "b_regularizer": null}}, {"class_name": "Dense", "config": {"name": "output", "trainable": true, "b_constraint": null, "input_dim": null, "activity_regularizer": null, "output_dim": 1, "bias": true, "W_constraint": null, "init": "glorot_uniform", "activation": "linear", "W_regularizer": null, "b_regularizer": null}}]}