{"keras_version": "1.1.1", "config": [{"config": {"name": "convolution2d_3", "W_constraint": null, "activation": "linear", "input_dtype": "float32", "trainable": true, "b_constraint": null, "activity_regularizer": null, "nb_filter": 16, "nb_row": 5, "subsample": [1, 1], "init": "glorot_uniform", "batch_input_shape": [null, 160, 320, 3], "border_mode": "valid", "b_regularizer": null, "nb_col": 5, "bias": true, "W_regularizer": null, "dim_ordering": "tf"}, "class_name": "Convolution2D"}, {"config": {"name": "batchnormalization_5", "epsilon": 1e-05, "beta_regularizer": null, "mode": 0, "momentum": 0.99, "axis": -1, "trainable": true, "gamma_regularizer": null}, "class_name": "BatchNormalization"}, {"config": {"trainable": true, "name": "activation_5", "activation": "relu"}, "class_name": "Activation"}, {"config": {"name": "maxpooling2d_3", "pool_size": [2, 2], "border_mode": "valid", "trainable": true, "dim_ordering": "tf", "strides": [2, 2]}, "class_name": "MaxPooling2D"}, {"config": {"W_constraint": null, "activation": "linear", "nb_filter": 32, "b_constraint": null, "activity_regularizer": null, "trainable": true, "nb_row": 5, "subsample": [2, 2], "init": "glorot_uniform", "name": "convolution2d_4", "border_mode": "valid", "b_regularizer": null, "nb_col": 5, "bias": true, "W_regularizer": null, "dim_ordering": "tf"}, "class_name": "Convolution2D"}, {"config": {"name": "batchnormalization_6", "epsilon": 1e-05, "beta_regularizer": null, "mode": 0, "momentum": 0.99, "axis": -1, "trainable": true, "gamma_regularizer": null}, "class_name": "BatchNormalization"}, {"config": {"trainable": true, "name": "activation_6", "activation": "relu"}, "class_name": "Activation"}, {"config": {"name": "maxpooling2d_4", "pool_size": [2, 2], "border_mode": "valid", "trainable": true, "dim_ordering": "tf", "strides": [2, 2]}, "class_name": "MaxPooling2D"}, {"config": {"trainable": true, "name": "dropout_1", "p": 0.5}, "class_name": "Dropout"}, {"config": {"W_constraint": null, "activation": "linear", "nb_filter": 64, "b_constraint": null, "activity_regularizer": null, "trainable": true, "nb_row": 5, "subsample": [2, 2], "init": "glorot_uniform", "name": "convolution2d_5", "border_mode": "valid", "b_regularizer": null, "nb_col": 5, "bias": true, "W_regularizer": null, "dim_ordering": "tf"}, "class_name": "Convolution2D"}, {"config": {"name": "batchnormalization_7", "epsilon": 1e-05, "beta_regularizer": null, "mode": 0, "momentum": 0.99, "axis": -1, "trainable": true, "gamma_regularizer": null}, "class_name": "BatchNormalization"}, {"config": {"trainable": true, "name": "activation_7", "activation": "relu"}, "class_name": "Activation"}, {"config": {"name": "maxpooling2d_5", "pool_size": [2, 2], "border_mode": "valid", "trainable": true, "dim_ordering": "tf", "strides": [2, 2]}, "class_name": "MaxPooling2D"}, {"config": {"name": "flatten_2", "trainable": true}, "class_name": "Flatten"}, {"config": {"activity_regularizer": null, "activation": "linear", "output_dim": 256, "b_constraint": null, "W_constraint": null, "trainable": true, "init": "glorot_uniform", "name": "dense_4", "b_regularizer": null, "bias": true, "W_regularizer": null, "input_dim": null}, "class_name": "Dense"}, {"config": {"name": "batchnormalization_8", "epsilon": 1e-05, "beta_regularizer": null, "mode": 0, "momentum": 0.99, "axis": -1, "trainable": true, "gamma_regularizer": null}, "class_name": "BatchNormalization"}, {"config": {"trainable": true, "name": "activation_8", "activation": "relu"}, "class_name": "Activation"}, {"config": {"activity_regularizer": null, "activation": "linear", "output_dim": 1024, "b_constraint": null, "W_constraint": null, "trainable": true, "init": "glorot_uniform", "name": "dense_5", "b_regularizer": null, "bias": true, "W_regularizer": null, "input_dim": null}, "class_name": "Dense"}, {"config": {"name": "batchnormalization_9", "epsilon": 1e-05, "beta_regularizer": null, "mode": 0, "momentum": 0.99, "axis": -1, "trainable": true, "gamma_regularizer": null}, "class_name": "BatchNormalization"}, {"config": {"trainable": true, "name": "activation_9", "activation": "relu"}, "class_name": "Activation"}, {"config": {"activity_regularizer": null, "activation": "linear", "output_dim": 1, "b_constraint": null, "W_constraint": null, "trainable": true, "init": "glorot_uniform", "name": "dense_6", "b_regularizer": null, "bias": true, "W_regularizer": null, "input_dim": null}, "class_name": "Dense"}], "class_name": "Sequential"}