{"keras_version": "1.1.1", "config": [{"config": {"batch_input_shape": [null, 160, 320, 3], "dim_ordering": "tf", "border_mode": "same", "nb_filter": 24, "b_regularizer": null, "b_constraint": null, "subsample": [2, 2], "nb_col": 5, "trainable": true, "bias": true, "name": "convolution2d_30", "activity_regularizer": null, "activation": "linear", "input_dtype": "float32", "W_constraint": null, "nb_row": 5, "W_regularizer": null, "init": "glorot_uniform"}, "class_name": "Convolution2D"}, {"config": {"trainable": true, "name": "Conv1", "activation": "relu"}, "class_name": "Activation"}, {"config": {"dim_ordering": "tf", "b_regularizer": null, "border_mode": "valid", "nb_filter": 36, "b_constraint": null, "subsample": [2, 2], "nb_col": 5, "trainable": true, "bias": true, "name": "convolution2d_31", "activity_regularizer": null, "activation": "linear", "nb_row": 5, "W_constraint": null, "W_regularizer": null, "init": "glorot_uniform"}, "class_name": "Convolution2D"}, {"config": {"trainable": true, "name": "Conv2", "activation": "relu"}, "class_name": "Activation"}, {"config": {"dim_ordering": "tf", "trainable": true, "name": "maxpooling2d_12", "pool_size": [2, 2], "border_mode": "valid", "strides": [2, 2]}, "class_name": "MaxPooling2D"}, {"config": {"trainable": true, "p": 0.5, "name": "dropout_7"}, "class_name": "Dropout"}, {"config": {"dim_ordering": "tf", "b_regularizer": null, "border_mode": "valid", "nb_filter": 48, "b_constraint": null, "subsample": [1, 1], "nb_col": 5, "trainable": true, "bias": true, "name": "convolution2d_32", "activity_regularizer": null, "activation": "linear", "nb_row": 5, "W_constraint": null, "W_regularizer": null, "init": "glorot_uniform"}, "class_name": "Convolution2D"}, {"config": {"axis": -1, "trainable": true, "mode": 0, "epsilon": 1e-05, "name": "batchnormalization_44", "gamma_regularizer": null, "beta_regularizer": null, "momentum": 0.99}, "class_name": "BatchNormalization"}, {"config": {"trainable": true, "name": "Conv3", "activation": "relu"}, "class_name": "Activation"}, {"config": {"dim_ordering": "tf", "b_regularizer": null, "border_mode": "valid", "nb_filter": 64, "b_constraint": null, "subsample": [1, 1], "nb_col": 3, "trainable": true, "bias": true, "name": "convolution2d_33", "activity_regularizer": null, "activation": "linear", "nb_row": 3, "W_constraint": null, "W_regularizer": null, "init": "glorot_uniform"}, "class_name": "Convolution2D"}, {"config": {"axis": -1, "trainable": true, "mode": 0, "epsilon": 1e-05, "name": "batchnormalization_45", "gamma_regularizer": null, "beta_regularizer": null, "momentum": 0.99}, "class_name": "BatchNormalization"}, {"config": {"trainable": true, "name": "Conv4", "activation": "relu"}, "class_name": "Activation"}, {"config": {"dim_ordering": "tf", "trainable": true, "name": "maxpooling2d_13", "pool_size": [2, 2], "border_mode": "valid", "strides": [2, 2]}, "class_name": "MaxPooling2D"}, {"config": {"trainable": true, "p": 0.5, "name": "dropout_8"}, "class_name": "Dropout"}, {"config": {"trainable": true, "name": "flatten_7"}, "class_name": "Flatten"}, {"config": {"input_dim": null, "b_regularizer": null, "b_constraint": null, "trainable": true, "bias": true, "name": "dense_26", "activity_regularizer": null, "activation": "linear", "W_constraint": null, "W_regularizer": null, "output_dim": 1164, "init": "glorot_uniform"}, "class_name": "Dense"}, {"config": {"trainable": true, "name": "FC1", "activation": "relu"}, "class_name": "Activation"}, {"config": {"input_dim": null, "b_regularizer": null, "b_constraint": null, "trainable": true, "bias": true, "name": "dense_27", "activity_regularizer": null, "activation": "linear", "W_constraint": null, "W_regularizer": null, "output_dim": 100, "init": "glorot_uniform"}, "class_name": "Dense"}, {"config": {"trainable": true, "name": "FC2", "activation": "relu"}, "class_name": "Activation"}, {"config": {"input_dim": null, "b_regularizer": null, "b_constraint": null, "trainable": true, "bias": true, "name": "dense_28", "activity_regularizer": null, "activation": "linear", "W_constraint": null, "W_regularizer": null, "output_dim": 50, "init": "glorot_uniform"}, "class_name": "Dense"}, {"config": {"trainable": true, "name": "FC3", "activation": "relu"}, "class_name": "Activation"}, {"config": {"input_dim": null, "b_regularizer": null, "b_constraint": null, "trainable": true, "bias": true, "name": "dense_29", "activity_regularizer": null, "activation": "linear", "W_constraint": null, "W_regularizer": null, "output_dim": 10, "init": "glorot_uniform"}, "class_name": "Dense"}, {"config": {"axis": -1, "trainable": true, "mode": 0, "epsilon": 1e-05, "name": "batchnormalization_46", "gamma_regularizer": null, "beta_regularizer": null, "momentum": 0.99}, "class_name": "BatchNormalization"}, {"config": {"trainable": true, "name": "FC4", "activation": "relu"}, "class_name": "Activation"}, {"config": {"input_dim": null, "b_regularizer": null, "b_constraint": null, "trainable": true, "bias": true, "name": "output", "activity_regularizer": null, "activation": "relu", "W_constraint": null, "W_regularizer": null, "output_dim": 1, "init": "glorot_uniform"}, "class_name": "Dense"}], "class_name": "Sequential"}