{"config": [{"config": {"input_dtype": "float32", "init": "glorot_uniform", "W_regularizer": null, "trainable": true, "dim_ordering": "tf", "b_regularizer": null, "activity_regularizer": null, "border_mode": "same", "name": "convolution2d_1", "nb_col": 5, "nb_row": 5, "activation": "linear", "b_constraint": null, "bias": true, "nb_filter": 24, "batch_input_shape": [null, 160, 320, 3], "W_constraint": null, "subsample": [1, 1]}, "class_name": "Convolution2D"}, {"config": {"name": "Conv1", "trainable": true, "activation": "relu"}, "class_name": "Activation"}, {"config": {"init": "glorot_uniform", "W_regularizer": null, "trainable": true, "dim_ordering": "tf", "activity_regularizer": null, "border_mode": "valid", "name": "convolution2d_2", "nb_col": 5, "nb_row": 5, "activation": "linear", "b_constraint": null, "bias": true, "nb_filter": 36, "b_regularizer": null, "W_constraint": null, "subsample": [1, 1]}, "class_name": "Convolution2D"}, {"config": {"name": "Conv2", "trainable": true, "activation": "relu"}, "class_name": "Activation"}, {"config": {"init": "glorot_uniform", "W_regularizer": null, "trainable": true, "dim_ordering": "tf", "activity_regularizer": null, "border_mode": "valid", "name": "convolution2d_3", "nb_col": 5, "nb_row": 5, "activation": "linear", "b_constraint": null, "bias": true, "nb_filter": 48, "b_regularizer": null, "W_constraint": null, "subsample": [1, 1]}, "class_name": "Convolution2D"}, {"config": {"name": "Conv3", "trainable": true, "activation": "relu"}, "class_name": "Activation"}, {"config": {"name": "maxpooling2d_1", "trainable": true, "pool_size": [2, 2], "dim_ordering": "tf", "strides": [2, 2], "border_mode": "valid"}, "class_name": "MaxPooling2D"}, {"config": {"name": "blockpooldropout_1", "trainable": true, "p": 0.5}, "class_name": "Dropout"}, {"config": {"init": "glorot_uniform", "W_regularizer": null, "trainable": true, "dim_ordering": "tf", "activity_regularizer": null, "border_mode": "valid", "name": "convolution2d_4", "nb_col": 5, "nb_row": 5, "activation": "linear", "b_constraint": null, "bias": true, "nb_filter": 64, "b_regularizer": null, "W_constraint": null, "subsample": [2, 2]}, "class_name": "Convolution2D"}, {"config": {"name": "batchnormalization_1", "trainable": true, "mode": 0, "epsilon": 1e-05, "beta_regularizer": null, "gamma_regularizer": null, "axis": -1, "momentum": 0.99}, "class_name": "BatchNormalization"}, {"config": {"name": "Conv4", "trainable": true, "activation": "relu"}, "class_name": "Activation"}, {"config": {"init": "glorot_uniform", "W_regularizer": null, "trainable": true, "dim_ordering": "tf", "activity_regularizer": null, "border_mode": "valid", "name": "convolution2d_5", "nb_col": 3, "nb_row": 3, "activation": "linear", "b_constraint": null, "bias": true, "nb_filter": 128, "b_regularizer": null, "W_constraint": null, "subsample": [2, 2]}, "class_name": "Convolution2D"}, {"config": {"name": "batchnormalization_2", "trainable": true, "mode": 0, "epsilon": 1e-05, "beta_regularizer": null, "gamma_regularizer": null, "axis": -1, "momentum": 0.99}, "class_name": "BatchNormalization"}, {"config": {"name": "Conv5", "trainable": true, "activation": "relu"}, "class_name": "Activation"}, {"config": {"name": "maxpooling2d_2", "trainable": true, "pool_size": [2, 2], "dim_ordering": "tf", "strides": [2, 2], "border_mode": "valid"}, "class_name": "MaxPooling2D"}, {"config": {"name": "blockpooldropout_2", "trainable": true, "p": 0.5}, "class_name": "Dropout"}, {"config": {"name": "flatten_1", "trainable": true}, "class_name": "Flatten"}, {"config": {"init": "glorot_uniform", "W_regularizer": null, "input_dim": null, "name": "dense_1", "trainable": true, "activity_regularizer": null, "activation": "linear", "b_constraint": null, "bias": true, "b_regularizer": null, "W_constraint": null, "output_dim": 500}, "class_name": "Dense"}, {"config": {"name": "FC2", "trainable": true, "activation": "relu"}, "class_name": "Activation"}, {"config": {"init": "glorot_uniform", "W_regularizer": null, "input_dim": null, "name": "dense_2", "trainable": true, "activity_regularizer": null, "activation": "linear", "b_constraint": null, "bias": true, "b_regularizer": null, "W_constraint": null, "output_dim": 100}, "class_name": "Dense"}, {"config": {"name": "FC3", "trainable": true, "activation": "relu"}, "class_name": "Activation"}, {"config": {"init": "glorot_uniform", "W_regularizer": null, "input_dim": null, "name": "dense_3", "trainable": true, "activity_regularizer": null, "activation": "linear", "b_constraint": null, "bias": true, "b_regularizer": null, "W_constraint": null, "output_dim": 10}, "class_name": "Dense"}, {"config": {"name": "batchnormalization_3", "trainable": true, "mode": 0, "epsilon": 1e-05, "beta_regularizer": null, "gamma_regularizer": null, "axis": -1, "momentum": 0.99}, "class_name": "BatchNormalization"}, {"config": {"name": "FC4", "trainable": true, "activation": "relu"}, "class_name": "Activation"}, {"config": {"init": "glorot_uniform", "W_regularizer": null, "input_dim": null, "name": "output", "trainable": true, "activity_regularizer": null, "activation": "linear", "b_constraint": null, "bias": true, "b_regularizer": null, "W_constraint": null, "output_dim": 1}, "class_name": "Dense"}], "keras_version": "1.1.1", "class_name": "Sequential"}