{"keras_version": "1.1.1", "config": [{"config": {"name": "convolution2d_1", "W_constraint": null, "activation": "linear", "input_dtype": "float32", "trainable": true, "b_constraint": null, "activity_regularizer": null, "nb_filter": 16, "nb_row": 5, "subsample": [1, 1], "init": "glorot_uniform", "batch_input_shape": [null, 160, 320, 3], "border_mode": "valid", "b_regularizer": null, "nb_col": 5, "bias": true, "W_regularizer": null, "dim_ordering": "tf"}, "class_name": "Convolution2D"}, {"config": {"name": "batchnormalization_1", "epsilon": 1e-05, "beta_regularizer": null, "mode": 0, "momentum": 0.99, "axis": -1, "trainable": true, "gamma_regularizer": null}, "class_name": "BatchNormalization"}, {"config": {"trainable": true, "name": "activation_1", "activation": "relu"}, "class_name": "Activation"}, {"config": {"name": "maxpooling2d_1", "pool_size": [2, 2], "border_mode": "valid", "trainable": true, "dim_ordering": "tf", "strides": [2, 2]}, "class_name": "MaxPooling2D"}, {"config": {"W_constraint": null, "activation": "linear", "nb_filter": 64, "b_constraint": null, "activity_regularizer": null, "trainable": true, "nb_row": 5, "subsample": [2, 2], "init": "glorot_uniform", "name": "convolution2d_2", "border_mode": "valid", "b_regularizer": null, "nb_col": 5, "bias": true, "W_regularizer": null, "dim_ordering": "tf"}, "class_name": "Convolution2D"}, {"config": {"name": "batchnormalization_2", "epsilon": 1e-05, "beta_regularizer": null, "mode": 0, "momentum": 0.99, "axis": -1, "trainable": true, "gamma_regularizer": null}, "class_name": "BatchNormalization"}, {"config": {"trainable": true, "name": "activation_2", "activation": "relu"}, "class_name": "Activation"}, {"config": {"name": "maxpooling2d_2", "pool_size": [2, 2], "border_mode": "valid", "trainable": true, "dim_ordering": "tf", "strides": [2, 2]}, "class_name": "MaxPooling2D"}, {"config": {"name": "flatten_1", "trainable": true}, "class_name": "Flatten"}, {"config": {"activity_regularizer": null, "activation": "linear", "output_dim": 256, "b_constraint": null, "W_constraint": null, "trainable": true, "init": "glorot_uniform", "name": "dense_1", "b_regularizer": null, "bias": true, "W_regularizer": null, "input_dim": null}, "class_name": "Dense"}, {"config": {"name": "batchnormalization_3", "epsilon": 1e-05, "beta_regularizer": null, "mode": 0, "momentum": 0.99, "axis": -1, "trainable": true, "gamma_regularizer": null}, "class_name": "BatchNormalization"}, {"config": {"trainable": true, "name": "activation_3", "activation": "relu"}, "class_name": "Activation"}, {"config": {"activity_regularizer": null, "activation": "linear", "output_dim": 1024, "b_constraint": null, "W_constraint": null, "trainable": true, "init": "glorot_uniform", "name": "dense_2", "b_regularizer": null, "bias": true, "W_regularizer": null, "input_dim": null}, "class_name": "Dense"}, {"config": {"name": "batchnormalization_4", "epsilon": 1e-05, "beta_regularizer": null, "mode": 0, "momentum": 0.99, "axis": -1, "trainable": true, "gamma_regularizer": null}, "class_name": "BatchNormalization"}, {"config": {"trainable": true, "name": "activation_4", "activation": "relu"}, "class_name": "Activation"}, {"config": {"activity_regularizer": null, "activation": "linear", "output_dim": 1, "b_constraint": null, "W_constraint": null, "trainable": true, "init": "glorot_uniform", "name": "dense_3", "b_regularizer": null, "bias": true, "W_regularizer": null, "input_dim": null}, "class_name": "Dense"}], "class_name": "Sequential"}