{"keras_version": "1.1.1", "class_name": "Sequential", "config": [{"class_name": "InputLayer", "config": {"batch_input_shape": [null, 224, 224, 3], "name": "input_14", "input_dtype": "float32", "sparse": false}}, {"class_name": "Convolution2D", "config": {"b_constraint": null, "border_mode": "same", "dim_ordering": "tf", "bias": true, "b_regularizer": null, "name": "block1_conv1", "activity_regularizer": null, "init": "glorot_uniform", "nb_row": 3, "trainable": false, "activation": "relu", "W_regularizer": null, "W_constraint": null, "nb_col": 3, "subsample": [1, 1], "nb_filter": 64}}, {"class_name": "Convolution2D", "config": {"b_constraint": null, "border_mode": "same", "dim_ordering": "tf", "bias": true, "b_regularizer": null, "name": "block1_conv2", "activity_regularizer": null, "init": "glorot_uniform", "nb_row": 3, "trainable": false, "activation": "relu", "W_regularizer": null, "W_constraint": null, "nb_col": 3, "subsample": [1, 1], "nb_filter": 64}}, {"class_name": "MaxPooling2D", "config": {"name": "block1_pool", "border_mode": "valid", "pool_size": [2, 2], "dim_ordering": "tf", "trainable": false, "strides": [2, 2]}}, {"class_name": "Convolution2D", "config": {"b_constraint": null, "border_mode": "same", "dim_ordering": "tf", "bias": true, "b_regularizer": null, "name": "block2_conv1", "activity_regularizer": null, "init": "glorot_uniform", "nb_row": 3, "trainable": false, "activation": "relu", "W_regularizer": null, "W_constraint": null, "nb_col": 3, "subsample": [1, 1], "nb_filter": 128}}, {"class_name": "Convolution2D", "config": {"b_constraint": null, "border_mode": "same", "dim_ordering": "tf", "bias": true, "b_regularizer": null, "name": "block2_conv2", "activity_regularizer": null, "init": "glorot_uniform", "nb_row": 3, "trainable": false, "activation": "relu", "W_regularizer": null, "W_constraint": null, "nb_col": 3, "subsample": [1, 1], "nb_filter": 128}}, {"class_name": "MaxPooling2D", "config": {"name": "block2_pool", "border_mode": "valid", "pool_size": [2, 2], "dim_ordering": "tf", "trainable": false, "strides": [2, 2]}}, {"class_name": "Convolution2D", "config": {"b_constraint": null, "border_mode": "same", "dim_ordering": "tf", "bias": true, "b_regularizer": null, "name": "block3_conv1", "activity_regularizer": null, "init": "glorot_uniform", "nb_row": 3, "trainable": false, "activation": "relu", "W_regularizer": null, "W_constraint": null, "nb_col": 3, "subsample": [1, 1], "nb_filter": 256}}, {"class_name": "Convolution2D", "config": {"b_constraint": null, "border_mode": "same", "dim_ordering": "tf", "bias": true, "b_regularizer": null, "name": "block3_conv2", "activity_regularizer": null, "init": "glorot_uniform", "nb_row": 3, "trainable": false, "activation": "relu", "W_regularizer": null, "W_constraint": null, "nb_col": 3, "subsample": [1, 1], "nb_filter": 256}}, {"class_name": "Convolution2D", "config": {"b_constraint": null, "border_mode": "same", "dim_ordering": "tf", "bias": true, "b_regularizer": null, "name": "block3_conv3", "activity_regularizer": null, "init": "glorot_uniform", "nb_row": 3, "trainable": false, "activation": "relu", "W_regularizer": null, "W_constraint": null, "nb_col": 3, "subsample": [1, 1], "nb_filter": 256}}, {"class_name": "MaxPooling2D", "config": {"name": "block3_pool", "border_mode": "valid", "pool_size": [2, 2], "dim_ordering": "tf", "trainable": false, "strides": [2, 2]}}, {"class_name": "Convolution2D", "config": {"b_constraint": null, "border_mode": "valid", "dim_ordering": "tf", "bias": true, "b_regularizer": null, "name": "convolution2d_40", "activity_regularizer": null, "init": "glorot_uniform", "nb_row": 5, "trainable": true, "activation": "linear", "W_regularizer": null, "W_constraint": null, "nb_col": 5, "subsample": [1, 1], "nb_filter": 24}}, {"class_name": "BatchNormalization", "config": {"epsilon": 1e-05, "name": "batchnormalization_42", "momentum": 0.99, "gamma_regularizer": null, "mode": 0, "axis": -1, "trainable": true, "beta_regularizer": null}}, {"class_name": "Activation", "config": {"name": "activation_46", "trainable": true, "activation": "relu"}}, {"class_name": "Dropout", "config": {"p": 0.5, "name": "dropout_17", "trainable": true}}, {"class_name": "Convolution2D", "config": {"b_constraint": null, "border_mode": "valid", "dim_ordering": "tf", "bias": true, "b_regularizer": null, "name": "convolution2d_41", "activity_regularizer": null, "init": "glorot_uniform", "nb_row": 5, "trainable": true, "activation": "linear", "W_regularizer": null, "W_constraint": null, "nb_col": 5, "subsample": [1, 1], "nb_filter": 36}}, {"class_name": "BatchNormalization", "config": {"epsilon": 1e-05, "name": "batchnormalization_43", "momentum": 0.99, "gamma_regularizer": null, "mode": 0, "axis": -1, "trainable": true, "beta_regularizer": null}}, {"class_name": "Activation", "config": {"name": "activation_47", "trainable": true, "activation": "relu"}}, {"class_name": "Dropout", "config": {"p": 0.5, "name": "dropout_18", "trainable": true}}, {"class_name": "Convolution2D", "config": {"b_constraint": null, "border_mode": "valid", "dim_ordering": "tf", "bias": true, "b_regularizer": null, "name": "convolution2d_42", "activity_regularizer": null, "init": "glorot_uniform", "nb_row": 5, "trainable": true, "activation": "linear", "W_regularizer": null, "W_constraint": null, "nb_col": 5, "subsample": [1, 1], "nb_filter": 48}}, {"class_name": "BatchNormalization", "config": {"epsilon": 1e-05, "name": "batchnormalization_44", "momentum": 0.99, "gamma_regularizer": null, "mode": 0, "axis": -1, "trainable": true, "beta_regularizer": null}}, {"class_name": "Activation", "config": {"name": "activation_48", "trainable": true, "activation": "relu"}}, {"class_name": "Dropout", "config": {"p": 0.5, "name": "dropout_19", "trainable": true}}, {"class_name": "Convolution2D", "config": {"b_constraint": null, "border_mode": "valid", "dim_ordering": "tf", "bias": true, "b_regularizer": null, "name": "convolution2d_43", "activity_regularizer": null, "init": "glorot_uniform", "nb_row": 3, "trainable": true, "activation": "linear", "W_regularizer": null, "W_constraint": null, "nb_col": 3, "subsample": [1, 1], "nb_filter": 64}}, {"class_name": "BatchNormalization", "config": {"epsilon": 1e-05, "name": "batchnormalization_45", "momentum": 0.99, "gamma_regularizer": null, "mode": 0, "axis": -1, "trainable": true, "beta_regularizer": null}}, {"class_name": "Activation", "config": {"name": "activation_49", "trainable": true, "activation": "relu"}}, {"class_name": "Convolution2D", "config": {"b_constraint": null, "border_mode": "valid", "dim_ordering": "tf", "bias": true, "b_regularizer": null, "name": "convolution2d_44", "activity_regularizer": null, "init": "glorot_uniform", "nb_row": 3, "trainable": true, "activation": "linear", "W_regularizer": null, "W_constraint": null, "nb_col": 3, "subsample": [1, 1], "nb_filter": 64}}, {"class_name": "BatchNormalization", "config": {"epsilon": 1e-05, "name": "batchnormalization_46", "momentum": 0.99, "gamma_regularizer": null, "mode": 0, "axis": -1, "trainable": true, "beta_regularizer": null}}, {"class_name": "Activation", "config": {"name": "activation_50", "trainable": true, "activation": "relu"}}, {"class_name": "Flatten", "config": {"name": "flatten_4", "trainable": true}}, {"class_name": "Dense", "config": {"b_constraint": null, "bias": true, "b_regularizer": null, "name": "dense_16", "output_dim": 1154, "init": "glorot_uniform", "activity_regularizer": null, "trainable": true, "input_dim": null, "activation": "linear", "W_regularizer": null, "W_constraint": null}}, {"class_name": "Activation", "config": {"name": "activation_51", "trainable": true, "activation": "relu"}}, {"class_name": "Dense", "config": {"b_constraint": null, "bias": true, "b_regularizer": null, "name": "dense_17", "output_dim": 100, "init": "glorot_uniform", "activity_regularizer": null, "trainable": true, "input_dim": null, "activation": "linear", "W_regularizer": null, "W_constraint": null}}, {"class_name": "Activation", "config": {"name": "activation_52", "trainable": true, "activation": "relu"}}, {"class_name": "Dense", "config": {"b_constraint": null, "bias": true, "b_regularizer": null, "name": "dense_18", "output_dim": 50, "init": "glorot_uniform", "activity_regularizer": null, "trainable": true, "input_dim": null, "activation": "linear", "W_regularizer": null, "W_constraint": null}}, {"class_name": "Activation", "config": {"name": "activation_53", "trainable": true, "activation": "relu"}}, {"class_name": "Dense", "config": {"b_constraint": null, "bias": true, "b_regularizer": null, "name": "dense_19", "output_dim": 10, "init": "glorot_uniform", "activity_regularizer": null, "trainable": true, "input_dim": null, "activation": "linear", "W_regularizer": null, "W_constraint": null}}, {"class_name": "Activation", "config": {"name": "activation_54", "trainable": true, "activation": "relu"}}, {"class_name": "Dense", "config": {"b_constraint": null, "bias": true, "b_regularizer": null, "name": "dense_20", "output_dim": 1, "init": "glorot_uniform", "activity_regularizer": null, "trainable": true, "input_dim": null, "activation": "linear", "W_regularizer": null, "W_constraint": null}}]}