{"config": [{"config": {"sparse": false, "batch_input_shape": [null, 224, 224, 3], "input_dtype": "float32", "name": "input_4"}, "class_name": "InputLayer"}, {"config": {"name": "block1_conv1", "trainable": false, "dim_ordering": "tf", "nb_col": 3, "W_constraint": null, "W_regularizer": null, "bias": true, "border_mode": "same", "init": "glorot_uniform", "b_regularizer": null, "nb_filter": 64, "activity_regularizer": null, "activation": "relu", "nb_row": 3, "b_constraint": null, "subsample": [1, 1]}, "class_name": "Convolution2D"}, {"config": {"name": "block1_conv2", "trainable": false, "dim_ordering": "tf", "nb_col": 3, "W_constraint": null, "W_regularizer": null, "bias": true, "border_mode": "same", "init": "glorot_uniform", "b_regularizer": null, "nb_filter": 64, "activity_regularizer": null, "activation": "relu", "nb_row": 3, "b_constraint": null, "subsample": [1, 1]}, "class_name": "Convolution2D"}, {"config": {"pool_size": [2, 2], "border_mode": "valid", "trainable": false, "dim_ordering": "tf", "strides": [2, 2], "name": "block1_pool"}, "class_name": "MaxPooling2D"}, {"config": {"name": "block2_conv1", "trainable": false, "dim_ordering": "tf", "nb_col": 3, "W_constraint": null, "W_regularizer": null, "bias": true, "border_mode": "same", "init": "glorot_uniform", "b_regularizer": null, "nb_filter": 128, "activity_regularizer": null, "activation": "relu", "nb_row": 3, "b_constraint": null, "subsample": [1, 1]}, "class_name": "Convolution2D"}, {"config": {"name": "block2_conv2", "trainable": false, "dim_ordering": "tf", "nb_col": 3, "W_constraint": null, "W_regularizer": null, "bias": true, "border_mode": "same", "init": "glorot_uniform", "b_regularizer": null, "nb_filter": 128, "activity_regularizer": null, "activation": "relu", "nb_row": 3, "b_constraint": null, "subsample": [1, 1]}, "class_name": "Convolution2D"}, {"config": {"pool_size": [2, 2], "border_mode": "valid", "trainable": false, "dim_ordering": "tf", "strides": [2, 2], "name": "block2_pool"}, "class_name": "MaxPooling2D"}, {"config": {"name": "block3_conv1", "trainable": false, "dim_ordering": "tf", "nb_col": 3, "W_constraint": null, "W_regularizer": null, "bias": true, "border_mode": "same", "init": "glorot_uniform", "b_regularizer": null, "nb_filter": 256, "activity_regularizer": null, "activation": "relu", "nb_row": 3, "b_constraint": null, "subsample": [1, 1]}, "class_name": "Convolution2D"}, {"config": {"name": "block3_conv2", "trainable": false, "dim_ordering": "tf", "nb_col": 3, "W_constraint": null, "W_regularizer": null, "bias": true, "border_mode": "same", "init": "glorot_uniform", "b_regularizer": null, "nb_filter": 256, "activity_regularizer": null, "activation": "relu", "nb_row": 3, "b_constraint": null, "subsample": [1, 1]}, "class_name": "Convolution2D"}, {"config": {"name": "block3_conv3", "trainable": false, "dim_ordering": "tf", "nb_col": 3, "W_constraint": null, "W_regularizer": null, "bias": true, "border_mode": "same", "init": "glorot_uniform", "b_regularizer": null, "nb_filter": 256, "activity_regularizer": null, "activation": "relu", "nb_row": 3, "b_constraint": null, "subsample": [1, 1]}, "class_name": "Convolution2D"}, {"config": {"pool_size": [2, 2], "border_mode": "valid", "trainable": false, "dim_ordering": "tf", "strides": [2, 2], "name": "block3_pool"}, "class_name": "MaxPooling2D"}, {"config": {"name": "convolution2d_11", "trainable": true, "dim_ordering": "tf", "nb_col": 5, "W_constraint": null, "W_regularizer": null, "bias": true, "border_mode": "valid", "init": "glorot_uniform", "b_regularizer": null, "nb_filter": 24, "activity_regularizer": null, "activation": "linear", "nb_row": 5, "b_constraint": null, "subsample": [1, 1]}, "class_name": "Convolution2D"}, {"config": {"name": "batchnormalization_14", "trainable": true, "momentum": 0.99, "beta_regularizer": null, "epsilon": 1e-05, "gamma_regularizer": null, "axis": -1, "mode": 0}, "class_name": "BatchNormalization"}, {"config": {"trainable": true, "name": "activation_14", "activation": "relu"}, "class_name": "Activation"}, {"config": {"name": "convolution2d_12", "trainable": true, "dim_ordering": "tf", "nb_col": 5, "W_constraint": null, "W_regularizer": null, "bias": true, "border_mode": "valid", "init": "glorot_uniform", "b_regularizer": null, "nb_filter": 36, "activity_regularizer": null, "activation": "linear", "nb_row": 5, "b_constraint": null, "subsample": [1, 1]}, "class_name": "Convolution2D"}, {"config": {"name": "batchnormalization_15", "trainable": true, "momentum": 0.99, "beta_regularizer": null, "epsilon": 1e-05, "gamma_regularizer": null, "axis": -1, "mode": 0}, "class_name": "BatchNormalization"}, {"config": {"trainable": true, "name": "activation_15", "activation": "relu"}, "class_name": "Activation"}, {"config": {"pool_size": [2, 2], "border_mode": "valid", "trainable": true, "dim_ordering": "tf", "strides": [2, 2], "name": "maxpooling2d_4"}, "class_name": "MaxPooling2D"}, {"config": {"p": 0.5, "trainable": true, "name": "dropout_7"}, "class_name": "Dropout"}, {"config": {"name": "convolution2d_13", "trainable": true, "dim_ordering": "tf", "nb_col": 5, "W_constraint": null, "W_regularizer": null, "bias": true, "border_mode": "valid", "init": "glorot_uniform", "b_regularizer": null, "nb_filter": 48, "activity_regularizer": null, "activation": "linear", "nb_row": 5, "b_constraint": null, "subsample": [1, 1]}, "class_name": "Convolution2D"}, {"config": {"name": "batchnormalization_16", "trainable": true, "momentum": 0.99, "beta_regularizer": null, "epsilon": 1e-05, "gamma_regularizer": null, "axis": -1, "mode": 0}, "class_name": "BatchNormalization"}, {"config": {"trainable": true, "name": "activation_16", "activation": "relu"}, "class_name": "Activation"}, {"config": {"p": 0.5, "trainable": true, "name": "dropout_8"}, "class_name": "Dropout"}, {"config": {"name": "convolution2d_14", "trainable": true, "dim_ordering": "tf", "nb_col": 3, "W_constraint": null, "W_regularizer": null, "bias": true, "border_mode": "valid", "init": "glorot_uniform", "b_regularizer": null, "nb_filter": 64, "activity_regularizer": null, "activation": "linear", "nb_row": 3, "b_constraint": null, "subsample": [1, 1]}, "class_name": "Convolution2D"}, {"config": {"name": "batchnormalization_17", "trainable": true, "momentum": 0.99, "beta_regularizer": null, "epsilon": 1e-05, "gamma_regularizer": null, "axis": -1, "mode": 0}, "class_name": "BatchNormalization"}, {"config": {"trainable": true, "name": "activation_17", "activation": "relu"}, "class_name": "Activation"}, {"config": {"p": 0.5, "trainable": true, "name": "dropout_9"}, "class_name": "Dropout"}, {"config": {"name": "convolution2d_15", "trainable": true, "dim_ordering": "tf", "nb_col": 3, "W_constraint": null, "W_regularizer": null, "bias": true, "border_mode": "valid", "init": "glorot_uniform", "b_regularizer": null, "nb_filter": 64, "activity_regularizer": null, "activation": "linear", "nb_row": 3, "b_constraint": null, "subsample": [1, 1]}, "class_name": "Convolution2D"}, {"config": {"name": "batchnormalization_18", "trainable": true, "momentum": 0.99, "beta_regularizer": null, "epsilon": 1e-05, "gamma_regularizer": null, "axis": -1, "mode": 0}, "class_name": "BatchNormalization"}, {"config": {"trainable": true, "name": "activation_18", "activation": "relu"}, "class_name": "Activation"}, {"config": {"name": "flatten_2", "trainable": true}, "class_name": "Flatten"}, {"config": {"input_dim": null, "output_dim": 1154, "trainable": true, "bias": true, "b_regularizer": null, "W_constraint": null, "W_regularizer": null, "init": "glorot_uniform", "activity_regularizer": null, "name": "dense_6", "b_constraint": null, "activation": "linear"}, "class_name": "Dense"}, {"config": {"name": "batchnormalization_19", "trainable": true, "momentum": 0.99, "beta_regularizer": null, "epsilon": 1e-05, "gamma_regularizer": null, "axis": -1, "mode": 0}, "class_name": "BatchNormalization"}, {"config": {"trainable": true, "name": "activation_19", "activation": "relu"}, "class_name": "Activation"}, {"config": {"input_dim": null, "output_dim": 100, "trainable": true, "bias": true, "b_regularizer": null, "W_constraint": null, "W_regularizer": null, "init": "glorot_uniform", "activity_regularizer": null, "name": "dense_7", "b_constraint": null, "activation": "linear"}, "class_name": "Dense"}, {"config": {"name": "batchnormalization_20", "trainable": true, "momentum": 0.99, "beta_regularizer": null, "epsilon": 1e-05, "gamma_regularizer": null, "axis": -1, "mode": 0}, "class_name": "BatchNormalization"}, {"config": {"trainable": true, "name": "activation_20", "activation": "relu"}, "class_name": "Activation"}, {"config": {"input_dim": null, "output_dim": 50, "trainable": true, "bias": true, "b_regularizer": null, "W_constraint": null, "W_regularizer": null, "init": "glorot_uniform", "activity_regularizer": null, "name": "dense_8", "b_constraint": null, "activation": "linear"}, "class_name": "Dense"}, {"config": {"name": "batchnormalization_21", "trainable": true, "momentum": 0.99, "beta_regularizer": null, "epsilon": 1e-05, "gamma_regularizer": null, "axis": -1, "mode": 0}, "class_name": "BatchNormalization"}, {"config": {"trainable": true, "name": "activation_21", "activation": "relu"}, "class_name": "Activation"}, {"config": {"input_dim": null, "output_dim": 10, "trainable": true, "bias": true, "b_regularizer": null, "W_constraint": null, "W_regularizer": null, "init": "glorot_uniform", "activity_regularizer": null, "name": "dense_9", "b_constraint": null, "activation": "linear"}, "class_name": "Dense"}, {"config": {"name": "batchnormalization_22", "trainable": true, "momentum": 0.99, "beta_regularizer": null, "epsilon": 1e-05, "gamma_regularizer": null, "axis": -1, "mode": 0}, "class_name": "BatchNormalization"}, {"config": {"trainable": true, "name": "activation_22", "activation": "sigmoid"}, "class_name": "Activation"}, {"config": {"input_dim": null, "output_dim": 1, "trainable": true, "bias": true, "b_regularizer": null, "W_constraint": null, "W_regularizer": null, "init": "glorot_uniform", "activity_regularizer": null, "name": "dense_10", "b_constraint": null, "activation": "linear"}, "class_name": "Dense"}], "keras_version": "1.1.1", "class_name": "Sequential"}